[NoCoverage] StringLiteral
src/router/_firebaseAuth.ts:26:12
  *       500:
  *         $ref: '#/components/responses/InternalServerError'
  */
-router.get('/token', async (request: Request, response: Response) => {
+router.get("", async (request: Request, response: Response) => {
     const user = request.headers.userid as string
     if (![ '1', '2' ].includes(user)) {

[NoCoverage] BooleanLiteral
src/router/_firebaseAuth.ts:28:9
  */
 router.get('/token', async (request: Request, response: Response) => {
     const user = request.headers.userid as string
-    if (![ '1', '2' ].includes(user)) {
+    if (['1', '2'].includes(user)) {
         return ResponseSender.error(response, InternalServerError.getErrorDocument('Test user not specified'))
     }

[NoCoverage] BlockStatement
src/router/_firebaseAuth.ts:28:39
  */
 router.get('/token', async (request: Request, response: Response) => {
     const user = request.headers.userid as string
-    if (![ '1', '2' ].includes(user)) {
-        return ResponseSender.error(response, InternalServerError.getErrorDocument('Test user not specified'))
-    }
+    if (![ '1', '2' ].includes(user)) {}
     const body = {
         email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,

[NoCoverage] EqualityOperator
src/router/_firebaseAuth.ts:32:16
         return ResponseSender.error(response, InternalServerError.getErrorDocument('Test user not specified'))
     }
     const body = {
-        email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
+        email: user !== '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
         password: user === '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
     }

[NoCoverage] ConditionalExpression
src/router/_firebaseAuth.ts:32:16
         return ResponseSender.error(response, InternalServerError.getErrorDocument('Test user not specified'))
     }
     const body = {
-        email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
+        email: true ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
         password: user === '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
     }

[NoCoverage] ConditionalExpression
src/router/_firebaseAuth.ts:33:19
     }
     const body = {
         email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
-        password: user === '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
+        password: true ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
     }
     try {

[NoCoverage] EqualityOperator
src/router/_firebaseAuth.ts:33:19
     }
     const body = {
         email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
-        password: user === '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
+        password: user !== '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
     }
     try {

[NoCoverage] BlockStatement
src/router/_firebaseAuth.ts:35:9
         email: user === '1' ? process.env.FIREBASE_TEST_USER1 : process.env.FIREBASE_TEST_USER2,
         password: user === '1' ? process.env.FIREBASE_TEST_PASSWORD1 : process.env.FIREBASE_TEST_PASSWORD2,
     }
-    try {
-        const token = await fetch(
-            // eslint-disable-next-line max-len
-            `https://identitytoolkit.googleapis.com/v1/accounts:signInWithPassword?key=${process.env.FIREBASE_WEB_API_KEY}`,
-            {
-                method: 'POST',
-                headers: {
-                    'Content-Type': 'application/json',
-                },
-                body: JSON.stringify({
-                    ...body,
-                    returnSecureToken: true,
-                }),
-            },
-        )
-        return response.status(200).json((await token.json() as any).idToken)
-    } catch (error: any) {
+    try {} catch (error: any) {
         return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
     }

[NoCoverage] BooleanLiteral
src/router/_firebaseAuth.ts:46:40
                 },
                 body: JSON.stringify({
                     ...body,
-                    returnSecureToken: true,
+                    returnSecureToken: false,
                 }),
             },

[NoCoverage] BlockStatement
src/router/_firebaseAuth.ts:51:26
             },
         )
         return response.status(200).json((await token.json() as any).idToken)
-    } catch (error: any) {
-        return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-    }
+    } catch (error: any) {}
 })
 
