[NoCoverage] BlockStatement
src/controller/friendshipController.ts:16:111
 
     private userRepository: UserRepositoryInterface
 
-    constructor(friendshipRepository: FriendshipRepositoryInterface, userRepository: UserRepositoryInterface) {
-        this.friendshipRepository = friendshipRepository
-        this.userRepository = userRepository
-    }
+    constructor(friendshipRepository: FriendshipRepositoryInterface, userRepository: UserRepositoryInterface) {}
 
     private userNotFoundError = (response: Response) => ResponseSender.error(

[NoCoverage] ArrowFunction
src/controller/friendshipController.ts:21:33
         this.userRepository = userRepository
     }
 
-    private userNotFoundError = (response: Response) => ResponseSender.error(
-        response,
-        NotFoundError.getErrorDocument('The user'),
-    )
+    private userNotFoundError = () => undefined
 
     private friendshipNotFoundError = (response: Response) => {

[NoCoverage] StringLiteral
src/controller/friendshipController.ts:23:40
 
     private userNotFoundError = (response: Response) => ResponseSender.error(
         response,
-        NotFoundError.getErrorDocument('The user'),
+        NotFoundError.getErrorDocument(""),
     )
 

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:26:63
         NotFoundError.getErrorDocument('The user'),
     )
 
-    private friendshipNotFoundError = (response: Response) => {
-        ResponseSender.error(response, NotFoundError.getErrorDocument('The friendship'))
-    }
+    private friendshipNotFoundError = (response: Response) => {}
 
     getFriendshipsByUid = async ({ userId }: { userId: string }, response: Response) => {

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:30:89
         ResponseSender.error(response, NotFoundError.getErrorDocument('The friendship'))
     }
 
-    getFriendshipsByUid = async ({ userId }: { userId: string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.friendshipRepository.getFriendshipsByUid(userId),
-            )
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return this.friendshipNotFoundError(response)
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getFriendshipsByUid = async ({ userId }: { userId: string }, response: Response) => {}
 
     createFriendship = async ({ friendsCode, uid }: { friendsCode: string, uid: string }, response: Response) => {

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:31:13
     }
 
     getFriendshipsByUid = async ({ userId }: { userId: string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.friendshipRepository.getFriendshipsByUid(userId),
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             if (error instanceof NotFoundError) {
                 return this.friendshipNotFoundError(response)

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:37:30
                 200,
                 await this.friendshipRepository.getFriendshipsByUid(userId),
             )
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return this.friendshipNotFoundError(response)
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:38:49
                 await this.friendshipRepository.getFriendshipsByUid(userId),
             )
         } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return this.friendshipNotFoundError(response)
-            }
+            if (error instanceof NotFoundError) {}
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:38:17
                 await this.friendshipRepository.getFriendshipsByUid(userId),
             )
         } catch (error: any) {
-            if (error instanceof NotFoundError) {
+            if (true) {
                 return this.friendshipNotFoundError(response)
             }

[NoCoverage] MethodExpression
src/controller/friendshipController.ts:49:58
         try {
             const [ invitor, invitee ] = await Promise.all([
                 this.userRepository.getUserByUid(uid),
-                this.userRepository.getUserByFriendsCode(friendsCode.toUpperCase()),
+                this.userRepository.getUserByFriendsCode(friendsCode.toLowerCase()),
             ])
 

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:52:17
                 this.userRepository.getUserByFriendsCode(friendsCode.toUpperCase()),
             ])
 
-            if (invitor.friendsCode === invitee.friendsCode) {
+            if (true) {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument('You can not add yourself.'))
             }

[NoCoverage] EqualityOperator
src/controller/friendshipController.ts:52:17
                 this.userRepository.getUserByFriendsCode(friendsCode.toUpperCase()),
             ])
 
-            if (invitor.friendsCode === invitee.friendsCode) {
+            if (invitor.friendsCode !== invitee.friendsCode) {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument('You can not add yourself.'))
             }

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:56:17
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument('You can not add yourself.'))
             }
 
-            try {
-                await this.friendshipRepository.checkForExistingFriendship(invitor, invitee)
-            } catch (error: any) {
+            try {} catch (error: any) {
                 return error instanceof FriendshipAlreadyExistsError
                     ? ResponseSender.error(response, ForbiddenError.getErrorDocument('Friendship already exists.'))

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:58:34
 
             try {
                 await this.friendshipRepository.checkForExistingFriendship(invitor, invitee)
-            } catch (error: any) {
-                return error instanceof FriendshipAlreadyExistsError
-                    ? ResponseSender.error(response, ForbiddenError.getErrorDocument('Friendship already exists.'))
-                    : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
+            } catch (error: any) {}
 
             const friendship = await this.friendshipRepository.createFriendship(invitor, invitee)

[NoCoverage] StringLiteral
src/controller/friendshipController.ts:60:86
                 await this.friendshipRepository.checkForExistingFriendship(invitor, invitee)
             } catch (error: any) {
                 return error instanceof FriendshipAlreadyExistsError
-                    ? ResponseSender.error(response, ForbiddenError.getErrorDocument('Friendship already exists.'))
+                    ? ResponseSender.error(response, ForbiddenError.getErrorDocument(""))
                     : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
             }

[NoCoverage] ObjectLiteral
src/controller/friendshipController.ts:73:25
                 invitor: friendship.invitor.id,
                 invitee: friendship.invitee.id,
                 status: friendship.status,
-                friend: { ...invitee },
+                friend: {},
             }
             return ResponseSender.result(response, 200, friendshipWithFriendData)

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:76:30
                 friend: { ...invitee },
             }
             return ResponseSender.result(response, 200, friendshipWithFriendData)
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 

[NoCoverage] EqualityOperator
src/controller/friendshipController.ts:87:17
         try {
             const friendship = await this.friendshipRepository.getFriendshipById(id)
 
-            if (friendship.invitee.uid !== uid) {
+            if (friendship.invitee.uid === uid) {
                 return ResponseSender.error(
                     response,

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:87:49
         try {
             const friendship = await this.friendshipRepository.getFriendshipById(id)
 
-            if (friendship.invitee.uid !== uid) {
-                return ResponseSender.error(
-                    response,
-                    ForbiddenError.getErrorDocument('You are not allowed to accept this friendship.'),
-                )
-            }
+            if (friendship.invitee.uid !== uid) {}
 
             if (friendship.status === FriendshipStatus.ACCEPTED) {

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:94:17
                 )
             }
 
-            if (friendship.status === FriendshipStatus.ACCEPTED) {
+            if (false) {
                 return ResponseSender.error(
                     response,

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:94:17
                 )
             }
 
-            if (friendship.status === FriendshipStatus.ACCEPTED) {
+            if (true) {
                 return ResponseSender.error(
                     response,

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:101:17
                 )
             }
 
-            try {
-                const { invitor, invitee, points } = await this.friendshipRepository.acceptFriendship(friendship)
-                const friendshipWithUpdatedUserPoints = {
-                    ...friendship,
-                    invitor,
-                    invitee,
-                }
-
-                return ResponseSender.result(
-                    response,
-                    200,
-                    friendshipWithUpdatedUserPoints,
-                    { amount: points, total: invitee.points },
-                )
-            } catch (error: any) {
+            try {} catch (error: any) {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
             }

[NoCoverage] ObjectLiteral
src/controller/friendshipController.ts:113:21
                     response,
                     200,
                     friendshipWithUpdatedUserPoints,
-                    { amount: points, total: invitee.points },
+                    {},
                 )
             } catch (error: any) {

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:115:34
                     friendshipWithUpdatedUserPoints,
                     { amount: points, total: invitee.points },
                 )
-            } catch (error: any) {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
+            } catch (error: any) {}
         } catch (error: any) {
             return error instanceof NotFoundError

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:118:30
             } catch (error: any) {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
             }
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.friendshipNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:125:114
         }
     }
 
-    declineOrDeleteFriendship = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            const friendship = await this.friendshipRepository.getFriendshipById(id)
-
-            if (!friendship) {
-                return this.friendshipNotFoundError(response)
-            }
-
-            if (friendship.invitor.uid !== uid && friendship.invitee.uid !== uid) {
-                return ResponseSender.error(
-                    response,
-                    ForbiddenError.getErrorDocument('You are not allowed to decline or delete this friendship.'),
-                )
-            }
-            await this.friendshipRepository.declineOrDeleteExistingFriendship(friendship)
-            return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return this.friendshipNotFoundError(response)
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    declineOrDeleteFriendship = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {}
 }
 

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:126:13
     }
 
     declineOrDeleteFriendship = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            const friendship = await this.friendshipRepository.getFriendshipById(id)
-
-            if (!friendship) {
-                return this.friendshipNotFoundError(response)
-            }
-
-            if (friendship.invitor.uid !== uid && friendship.invitee.uid !== uid) {
-                return ResponseSender.error(
-                    response,
-                    ForbiddenError.getErrorDocument('You are not allowed to decline or delete this friendship.'),
-                )
-            }
-            await this.friendshipRepository.declineOrDeleteExistingFriendship(friendship)
-            return response.sendStatus(204)
-        } catch (error: any) {
+        try {} catch (error: any) {
             if (error instanceof NotFoundError) {
                 return this.friendshipNotFoundError(response)

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:129:17
         try {
             const friendship = await this.friendshipRepository.getFriendshipById(id)
 
-            if (!friendship) {
+            if (true) {
                 return this.friendshipNotFoundError(response)
             }

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:129:17
         try {
             const friendship = await this.friendshipRepository.getFriendshipById(id)
 
-            if (!friendship) {
+            if (false) {
                 return this.friendshipNotFoundError(response)
             }

[NoCoverage] EqualityOperator
src/controller/friendshipController.ts:133:17
                 return this.friendshipNotFoundError(response)
             }
 
-            if (friendship.invitor.uid !== uid && friendship.invitee.uid !== uid) {
+            if (friendship.invitor.uid === uid && friendship.invitee.uid !== uid) {
                 return ResponseSender.error(
                     response,

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:133:17
                 return this.friendshipNotFoundError(response)
             }
 
-            if (friendship.invitor.uid !== uid && friendship.invitee.uid !== uid) {
+            if (false) {
                 return ResponseSender.error(
                     response,

[NoCoverage] BlockStatement
src/controller/friendshipController.ts:141:30
             }
             await this.friendshipRepository.declineOrDeleteExistingFriendship(friendship)
             return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return this.friendshipNotFoundError(response)
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 }

[NoCoverage] ConditionalExpression
src/controller/friendshipController.ts:142:17
             await this.friendshipRepository.declineOrDeleteExistingFriendship(friendship)
             return response.sendStatus(204)
         } catch (error: any) {
-            if (error instanceof NotFoundError) {
+            if (false) {
                 return this.friendshipNotFoundError(response)
             }
