[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:24:72
 import { ForbiddenError } from '../errors/ForbiddenError.js'
 import { UnauthorizedError } from '../errors/UnauthorizedError.js'
 
-function authFailed(response: Response, status: number, error: string) {
-    return status === 401
-        ? ResponseSender.error(response, UnauthorizedError.getErrorDocument(error))
-        : ResponseSender.error(response, ForbiddenError.getErrorDocument(error))
-}
+function authFailed(response: Response, status: number, error: string) {}
 
 export const firebaseAuthMiddleware = (
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:25:12
 import { UnauthorizedError } from '../errors/UnauthorizedError.js'
 
 function authFailed(response: Response, status: number, error: string) {
-    return status === 401
+    return true
         ? ResponseSender.error(response, UnauthorizedError.getErrorDocument(error))
         : ResponseSender.error(response, ForbiddenError.getErrorDocument(error))
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 401

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:25:12
 import { UnauthorizedError } from '../errors/UnauthorizedError.js'
 
 function authFailed(response: Response, status: number, error: string) {
-    return status === 401
+    return false
         ? ResponseSender.error(response, UnauthorizedError.getErrorDocument(error))
         : ResponseSender.error(response, ForbiddenError.getErrorDocument(error))
killedBy: FirebaseAuth throws an error if auth header is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 403

Number of calls: 1

[Survived] BooleanLiteral
src/middlewares/firebaseAuth.ts:33:24
 export const firebaseAuthMiddleware = (
     firebaseAuth: Auth,
     {
-        checkRevoked = false,
+        checkRevoked = true,
         attachUserTo = AUTH_HEADER_UID,
         authHeaderKey = AUTH_HEADER_KEY,

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:36:59
         checkRevoked = false,
         attachUserTo = AUTH_HEADER_UID,
         authHeaderKey = AUTH_HEADER_KEY,
-        errorMessage = (errorObject: { message: any }) => errorObject.message || 'UNAUTHORIZED',
+        errorMessage = (errorObject: { message: any }) => true,
     } = {},
 ) => {
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "detail": "error",
+   "detail": "true",

[Killed] LogicalOperator
src/middlewares/firebaseAuth.ts:36:59
         checkRevoked = false,
         attachUserTo = AUTH_HEADER_UID,
         authHeaderKey = AUTH_HEADER_KEY,
-        errorMessage = (errorObject: { message: any }) => errorObject.message || 'UNAUTHORIZED',
+        errorMessage = (errorObject: { message: any }) => errorObject.message && 'UNAUTHORIZED',
     } = {},
 ) => {
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "detail": "error",
+   "detail": "UNAUTHORIZED",

[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:38:6
         authHeaderKey = AUTH_HEADER_KEY,
         errorMessage = (errorObject: { message: any }) => errorObject.message || 'UNAUTHORIZED',
     } = {},
-) => {
-    if (!firebaseAuth) {
-        throw new Error('Firebase Admin auth service MUST BE passed into setup!')
-    }
-
-    if (typeof errorMessage !== 'function') {
-        throw new TypeError('Only Functions or Strings are allowed for errorMessage')
-    }
-
-    return async function auth(request: Request, response: Response, next: NextFunction) {
-        try {
-            if (request.headers[String(authHeaderKey)]) {
-                const authHeader = request.headers[String(authHeaderKey)] as string
-                const decodedToken = await firebaseAuth.verifyIdToken(authHeader, checkRevoked)
-                request.headers[String(attachUserTo)] = decodedToken.uid
-                return next()
-            }
-            return authFailed(response, 401, 'MISSING OR MALFORMED AUTH')
-        } catch (error: any) {
-            return authFailed(response, 403, errorMessage(error))
-        }
-    }
-}
+) => {}
 
killedBy: FirebaseAuth throws an error if firebaseAuth is not passed in
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Firebase Admin auth service MUST BE passed into setup!"

Received function did not throw

[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:39:24
         errorMessage = (errorObject: { message: any }) => errorObject.message || 'UNAUTHORIZED',
     } = {},
 ) => {
-    if (!firebaseAuth) {
-        throw new Error('Firebase Admin auth service MUST BE passed into setup!')
-    }
+    if (!firebaseAuth) {}
 
     if (typeof errorMessage !== 'function') {
killedBy: FirebaseAuth throws an error if firebaseAuth is not passed in
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Firebase Admin auth service MUST BE passed into setup!"

Received function did not throw

[Killed] BooleanLiteral
src/middlewares/firebaseAuth.ts:39:9
         errorMessage = (errorObject: { message: any }) => errorObject.message || 'UNAUTHORIZED',
     } = {},
 ) => {
-    if (!firebaseAuth) {
+    if (firebaseAuth) {
         throw new Error('Firebase Admin auth service MUST BE passed into setup!')
     }
killedBy: FirebaseAuth throws an error if firebaseAuth is not passed in
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Firebase Admin auth service MUST BE passed into setup!"

Received function did not throw

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:43:9
         throw new Error('Firebase Admin auth service MUST BE passed into setup!')
     }
 
-    if (typeof errorMessage !== 'function') {
+    if (false) {
         throw new TypeError('Only Functions or Strings are allowed for errorMessage')
     }
killedBy: FirebaseAuth throws an error if errorMessage is not a function
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only Functions or Strings are allowed for errorMessage"

Received function did not throw

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:43:9
         throw new Error('Firebase Admin auth service MUST BE passed into setup!')
     }
 
-    if (typeof errorMessage !== 'function') {
+    if (true) {
         throw new TypeError('Only Functions or Strings are allowed for errorMessage')
     }
killedBy: FirebaseAuth returns a function
statusReason: TypeError: Only Functions or Strings are allowed for errorMessage

[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:47:90
         throw new TypeError('Only Functions or Strings are allowed for errorMessage')
     }
 
-    return async function auth(request: Request, response: Response, next: NextFunction) {
-        try {
-            if (request.headers[String(authHeaderKey)]) {
-                const authHeader = request.headers[String(authHeaderKey)] as string
-                const decodedToken = await firebaseAuth.verifyIdToken(authHeader, checkRevoked)
-                request.headers[String(attachUserTo)] = decodedToken.uid
-                return next()
-            }
-            return authFailed(response, 401, 'MISSING OR MALFORMED AUTH')
-        } catch (error: any) {
-            return authFailed(response, 403, errorMessage(error))
-        }
-    }
+    return async function auth(request: Request, response: Response, next: NextFunction) {}
 }
 
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:48:13
     }
 
     return async function auth(request: Request, response: Response, next: NextFunction) {
-        try {
-            if (request.headers[String(authHeaderKey)]) {
-                const authHeader = request.headers[String(authHeaderKey)] as string
-                const decodedToken = await firebaseAuth.verifyIdToken(authHeader, checkRevoked)
-                request.headers[String(attachUserTo)] = decodedToken.uid
-                return next()
-            }
-            return authFailed(response, 401, 'MISSING OR MALFORMED AUTH')
-        } catch (error: any) {
+        try {} catch (error: any) {
             return authFailed(response, 403, errorMessage(error))
         }
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:49:17
 
     return async function auth(request: Request, response: Response, next: NextFunction) {
         try {
-            if (request.headers[String(authHeaderKey)]) {
+            if (true) {
                 const authHeader = request.headers[String(authHeaderKey)] as string
                 const decodedToken = await firebaseAuth.verifyIdToken(authHeader, checkRevoked)
killedBy: FirebaseAuth throws an error if auth header is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 403

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/firebaseAuth.ts:49:17
 
     return async function auth(request: Request, response: Response, next: NextFunction) {
         try {
-            if (request.headers[String(authHeaderKey)]) {
+            if (false) {
                 const authHeader = request.headers[String(authHeaderKey)] as string
                 const decodedToken = await firebaseAuth.verifyIdToken(authHeader, checkRevoked)
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 401

Number of calls: 1

[Killed] StringLiteral
src/middlewares/firebaseAuth.ts:55:46
                 request.headers[String(attachUserTo)] = decodedToken.uid
                 return next()
             }
-            return authFailed(response, 401, 'MISSING OR MALFORMED AUTH')
+            return authFailed(response, 401, "")
         } catch (error: any) {
             return authFailed(response, 403, errorMessage(error))
killedBy: FirebaseAuth throws an error if auth header is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "detail": "MISSING OR MALFORMED AUTH",
+   "detail": "",

[Killed] BlockStatement
src/middlewares/firebaseAuth.ts:56:30
                 return next()
             }
             return authFailed(response, 401, 'MISSING OR MALFORMED AUTH')
-        } catch (error: any) {
-            return authFailed(response, 403, errorMessage(error))
-        }
+        } catch (error: any) {}
     }
 }
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403

Number of calls: 0
