[NoCoverage] StringLiteral
src/migrations/Migration20221029215613.ts:7:21
     async up(): Promise<void> {
         this.addSql('alter table "user" add constraint "user_username_unique" unique ("username");')
-        this.addSql('alter table "user" add constraint "user_email_unique" unique ("email");')
+        this.addSql("")
         this.addSql('alter table "user" add constraint "user_uid_unique" unique ("uid");')
 

[NoCoverage] StringLiteral
src/migrations/Migration20221029215613.ts:16:21
 
         this.addSql('alter table "footprint" add constraint "footprint_created_by_id_foreign" foreign key ("created_by_id") references "user" ("id") on update cascade;')
 
-        this.addSql('alter table "footprint_reaction" add constraint "footprint_reaction_created_by_id_foreign" foreign key ("created_by_id") references "user" ("id") on update cascade;')
+        this.addSql("")
         this.addSql('alter table "footprint_reaction" add constraint "footprint_reaction_footprint_id_foreign" foreign key ("footprint_id") references "footprint" ("id") on update cascade;')
     }

[NoCoverage] BlockStatement
src/migrations/Migration20221029215613.ts:20:33
         this.addSql('alter table "footprint_reaction" add constraint "footprint_reaction_footprint_id_foreign" foreign key ("footprint_id") references "footprint" ("id") on update cascade;')
     }
 
-    async down(): Promise<void> {
-        this.addSql('alter table "footprint" drop constraint "footprint_created_by_id_foreign";')
-
-        this.addSql('alter table "footprint_reaction" drop constraint "footprint_reaction_created_by_id_foreign";')
-
-        this.addSql('alter table "footprint_reaction" drop constraint "footprint_reaction_footprint_id_foreign";')
-
-        this.addSql('drop table if exists "user" cascade;')
-
-        this.addSql('drop table if exists "footprint" cascade;')
-
-        this.addSql('drop table if exists "footprint_reaction" cascade;')
-    }
+    async down(): Promise<void> {}
 }
 

[NoCoverage] StringLiteral
src/migrations/Migration20221029215613.ts:31:21
 
         this.addSql('drop table if exists "footprint" cascade;')
 
-        this.addSql('drop table if exists "footprint_reaction" cascade;')
+        this.addSql("")
     }
 }
