[NoCoverage] BlockStatement
src/migrations/Migration20221108081629.ts:11:33
         this.addSql('alter table "friendship" add constraint "friendship_invitee_id_foreign" foreign key ("invitee_id") references "user" ("id") on update cascade;')
     }
 
-    async down(): Promise<void> {
-        this.addSql('drop table if exists "friendship" cascade;')
-    }
+    async down(): Promise<void> {}
 }
 
