[NoCoverage] BlockStatement
src/migrations/Migration20221109091811.ts:4:31
 import { Migration } from '@mikro-orm/migrations'
 
 export class Migration20221109091811 extends Migration {
-    async up(): Promise<void> {
-        this.addSql('alter table "friendship" drop constraint if exists "friendship_status_check";')
-
-        this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
-        this.addSql('alter table "user" alter column "friends_code" drop not null;')
-        this.addSql('create index "user_friends_code_index" on "user" ("friends_code");')
-
-        this.addSql('alter table "friendship" alter column "status" type text using ("status"::text);')
-        this.addSql('alter table "friendship" add constraint "friendship_status_check" check ("status" in (\'invited\', \'accepted\'));')
-    }
+    async up(): Promise<void> {}
 
     async down(): Promise<void> {

[NoCoverage] StringLiteral
src/migrations/Migration20221109091811.ts:7:21
     async up(): Promise<void> {
         this.addSql('alter table "friendship" drop constraint if exists "friendship_status_check";')
 
-        this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
+        this.addSql("")
         this.addSql('alter table "user" alter column "friends_code" drop not null;')
         this.addSql('create index "user_friends_code_index" on "user" ("friends_code");')

[NoCoverage] StringLiteral
src/migrations/Migration20221109091811.ts:8:21
         this.addSql('alter table "friendship" drop constraint if exists "friendship_status_check";')
 
         this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
-        this.addSql('alter table "user" alter column "friends_code" drop not null;')
+        this.addSql("")
         this.addSql('create index "user_friends_code_index" on "user" ("friends_code");')
 

[NoCoverage] StringLiteral
src/migrations/Migration20221109091811.ts:9:21
 
         this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
         this.addSql('alter table "user" alter column "friends_code" drop not null;')
-        this.addSql('create index "user_friends_code_index" on "user" ("friends_code");')
+        this.addSql("")
 
         this.addSql('alter table "friendship" alter column "status" type text using ("status"::text);')

[NoCoverage] BlockStatement
src/migrations/Migration20221109091811.ts:15:33
         this.addSql('alter table "friendship" add constraint "friendship_status_check" check ("status" in (\'invited\', \'accepted\'));')
     }
 
-    async down(): Promise<void> {
-        this.addSql('alter table "friendship" drop constraint if exists "friendship_status_check";')
-
-        this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
-        this.addSql('alter table "user" alter column "friends_code" set not null;')
-        this.addSql('drop index "user_friends_code_index";')
-
-        this.addSql('alter table "friendship" alter column "status" type smallint using ("status"::smallint);')
-    }
+    async down(): Promise<void> {}
 }
 

[NoCoverage] StringLiteral
src/migrations/Migration20221109091811.ts:16:21
     }
 
     async down(): Promise<void> {
-        this.addSql('alter table "friendship" drop constraint if exists "friendship_status_check";')
+        this.addSql("")
 
         this.addSql('alter table "user" alter column "friends_code" type varchar(255) using ("friends_code"::varchar(255));')
