[NoCoverage] BlockStatement
src/migrations/Migration20221205174609.ts:4:31
 import { Migration } from '@mikro-orm/migrations'
 
 export class Migration20221205174609 extends Migration {
-    async up(): Promise<void> {
-        this.addSql('alter table "user" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
-        this.addSql('alter table "user" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
-
-        this.addSql('alter table "friendship" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
-        this.addSql('alter table "friendship" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
-
-        this.addSql('alter table "footprint" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
-        this.addSql('alter table "footprint" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
-
-        this.addSql('alter table "footprint_reaction" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
-        this.addSql('alter table "footprint_reaction" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
-    }
+    async up(): Promise<void> {}
 
     async down(): Promise<void> {

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:5:21
 
 export class Migration20221205174609 extends Migration {
     async up(): Promise<void> {
-        this.addSql('alter table "user" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
+        this.addSql("")
         this.addSql('alter table "user" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
 

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:6:21
 export class Migration20221205174609 extends Migration {
     async up(): Promise<void> {
         this.addSql('alter table "user" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
-        this.addSql('alter table "user" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
+        this.addSql("")
 
         this.addSql('alter table "friendship" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:8:21
         this.addSql('alter table "user" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
         this.addSql('alter table "user" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
 
-        this.addSql('alter table "friendship" alter column "created_at" type timestamptz(0) using ("created_at"::timestamptz(0));')
+        this.addSql("")
         this.addSql('alter table "friendship" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
 

[NoCoverage] BlockStatement
src/migrations/Migration20221205174609.ts:18:33
         this.addSql('alter table "footprint_reaction" alter column "updated_at" type timestamptz(0) using ("updated_at"::timestamptz(0));')
     }
 
-    async down(): Promise<void> {
-        this.addSql('alter table "footprint" alter column "created_at" type varchar using ("created_at"::varchar);')
-        this.addSql('alter table "footprint" alter column "updated_at" type varchar using ("updated_at"::varchar);')
-
-        this.addSql('alter table "footprint_reaction" alter column "created_at" type varchar using ("created_at"::varchar);')
-        this.addSql('alter table "footprint_reaction" alter column "updated_at" type varchar using ("updated_at"::varchar);')
-
-        this.addSql('alter table "friendship" alter column "created_at" type varchar using ("created_at"::varchar);')
-        this.addSql('alter table "friendship" alter column "updated_at" type varchar using ("updated_at"::varchar);')
-
-        this.addSql('alter table "user" alter column "created_at" type varchar using ("created_at"::varchar);')
-        this.addSql('alter table "user" alter column "updated_at" type varchar using ("updated_at"::varchar);')
-    }
+    async down(): Promise<void> {}
 }
 

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:22:21
         this.addSql('alter table "footprint" alter column "created_at" type varchar using ("created_at"::varchar);')
         this.addSql('alter table "footprint" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 
-        this.addSql('alter table "footprint_reaction" alter column "created_at" type varchar using ("created_at"::varchar);')
+        this.addSql("")
         this.addSql('alter table "footprint_reaction" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:25:21
         this.addSql('alter table "footprint_reaction" alter column "created_at" type varchar using ("created_at"::varchar);')
         this.addSql('alter table "footprint_reaction" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 
-        this.addSql('alter table "friendship" alter column "created_at" type varchar using ("created_at"::varchar);')
+        this.addSql("")
         this.addSql('alter table "friendship" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:26:21
         this.addSql('alter table "footprint_reaction" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 
         this.addSql('alter table "friendship" alter column "created_at" type varchar using ("created_at"::varchar);')
-        this.addSql('alter table "friendship" alter column "updated_at" type varchar using ("updated_at"::varchar);')
+        this.addSql("")
 
         this.addSql('alter table "user" alter column "created_at" type varchar using ("created_at"::varchar);')

[NoCoverage] StringLiteral
src/migrations/Migration20221205174609.ts:28:21
         this.addSql('alter table "friendship" alter column "created_at" type varchar using ("created_at"::varchar);')
         this.addSql('alter table "friendship" alter column "updated_at" type varchar using ("updated_at"::varchar);')
 
-        this.addSql('alter table "user" alter column "created_at" type varchar using ("created_at"::varchar);')
+        this.addSql("")
         this.addSql('alter table "user" alter column "updated_at" type varchar using ("updated_at"::varchar);')
     }
