[NoCoverage] BlockStatement
src/migrations/Migration20221205175122.ts:4:31
 import { Migration } from '@mikro-orm/migrations'
 
 export class Migration20221205175122 extends Migration {
-    async up(): Promise<void> {
-        this.addSql('alter table "user" add column "points" int not null default 0;')
-    }
+    async up(): Promise<void> {}
 
     async down(): Promise<void> {

[NoCoverage] StringLiteral
src/migrations/Migration20221205175122.ts:5:21
 
 export class Migration20221205175122 extends Migration {
     async up(): Promise<void> {
-        this.addSql('alter table "user" add column "points" int not null default 0;')
+        this.addSql("")
     }
 

[NoCoverage] BlockStatement
src/migrations/Migration20221205175122.ts:8:33
         this.addSql('alter table "user" add column "points" int not null default 0;')
     }
 
-    async down(): Promise<void> {
-        this.addSql('alter table "user" drop column "points";')
-    }
+    async down(): Promise<void> {}
 }
 
