[NoCoverage] StringLiteral
src/migrations/Migration20221206133757.ts:5:21
 
 export class Migration20221206133757 extends Migration {
     async up(): Promise<void> {
-        this.addSql('create table "user_footprints" ("user_id" int not null, "footprint_id" int not null, constraint "user_footprints_pkey" primary key ("user_id", "footprint_id"));')
+        this.addSql("")
 
         this.addSql('alter table "user_footprints" add constraint "user_footprints_user_id_foreign" foreign key ("user_id") references "user" ("id") on update cascade on delete cascade;')

[NoCoverage] StringLiteral
src/migrations/Migration20221206133757.ts:7:21
     async up(): Promise<void> {
         this.addSql('create table "user_footprints" ("user_id" int not null, "footprint_id" int not null, constraint "user_footprints_pkey" primary key ("user_id", "footprint_id"));')
 
-        this.addSql('alter table "user_footprints" add constraint "user_footprints_user_id_foreign" foreign key ("user_id") references "user" ("id") on update cascade on delete cascade;')
+        this.addSql("")
     }

[NoCoverage] BlockStatement
src/migrations/Migration20221206133757.ts:11:33
     }
 
-    async down(): Promise<void> {
-        this.addSql('drop table if exists "user_footprints" cascade;')
-    }
+    async down(): Promise<void> {}
 }
 
