[NoCoverage] BlockStatement
src/migrations/Migration20230120225045.ts:4:31
 import { Migration } from '@mikro-orm/migrations'
 
 export class Migration20230120225045 extends Migration {
-    async up(): Promise<void> {
-        this.addSql('alter table "footprint" add column "temperature" int null;')
-    }
+    async up(): Promise<void> {}
 
     async down(): Promise<void> {

[NoCoverage] BlockStatement
src/migrations/Migration20230120225045.ts:8:33
         this.addSql('alter table "footprint" add column "temperature" int null;')
     }
 
-    async down(): Promise<void> {
-        this.addSql('alter table "footprint" drop column "temperature";')
-    }
+    async down(): Promise<void> {}
 }
 
