[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:32:7
         userRepository: UserRepositoryInterface,
         friendshipRepository: FriendshipRepositoryInterface,
         orm: ORM,
-    ) {
-        this.footprintService = footprintService
-        this.deletionService = deletionService
-        this.userRepository = userRepository
-        this.friendshipRepository = friendshipRepository
-        this.orm = orm
-    }
+    ) {}
 
     findFootprintById = async (id: number | string): Promise<Footprint> => {
killedBy: FootprintPostgresRepository returns all footprints
statusReason: TypeError: Cannot read properties of undefined (reading 'forkEm')

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:40:76
         this.orm = orm
     }
 
-    findFootprintById = async (id: number | string): Promise<Footprint> => {
-        const em = this.orm.forkEm()
-        return em.findOneOrFail(
-            'Footprint',
-            { id } as any,
-            { failHandler: () => { throw new NotFoundError() },
-                populate: ['createdBy'] } as any,
-        )
-    }
+    findFootprintById = async (id: number | string): Promise<Footprint> => {}
 
     createFootprint = async ({ title, description, latitude, longitude, files, uid }: NewFootprint) => {
killedBy: FootprintPostgresRepository findFootprintById returns one footprint by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/repositories/footprint/footprintPostgresRepository.ts:43:13
     findFootprintById = async (id: number | string): Promise<Footprint> => {
         const em = this.orm.forkEm()
         return em.findOneOrFail(
-            'Footprint',
+            "",
             { id } as any,
             { failHandler: () => { throw new NotFoundError() },
killedBy: FootprintPostgresRepository findFootprintById returns one footprint by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "Footprint",
+ "",
  {"id": 1},

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:59:29
         const temperatureData = await this
             .footprintService
             .getTemperature(latitude, longitude) as unknown as { main: { temp: number } }
-        const temperature = temperatureData?.main?.temp || undefined
+        const temperature = false
         const footprint = new Footprint(
             title,

[NoCoverage] LogicalOperator
src/repositories/footprint/footprintPostgresRepository.ts:59:29
         const temperatureData = await this
             .footprintService
             .getTemperature(latitude, longitude) as unknown as { main: { temp: number } }
-        const temperature = temperatureData?.main?.temp || undefined
+        const temperature = temperatureData?.main?.temp && undefined
         const footprint = new Footprint(
             title,

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:69:13
             audioURL,
             temperature,
         )
-        if (description) {
+        if (true) {
             em.assign(footprint, { description })
         }

[NoCoverage] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:69:26
             audioURL,
             temperature,
         )
-        if (description) {
-            em.assign(footprint, { description })
-        }
+        if (description) {}
         await em.persistAndFlush(footprint)
         const userWithUpdatedPoints = await this.userRepository.addPoints(uid, Points.FOOTPRINT_CREATED)

[NoCoverage] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:74:16
         }
         await em.persistAndFlush(footprint)
         const userWithUpdatedPoints = await this.userRepository.addPoints(uid, Points.FOOTPRINT_CREATED)
-        return {
-            footprint,
-            points: Points.FOOTPRINT_CREATED,
-            userPoints: userWithUpdatedPoints.points,
-        }
+        return {}
     }
 

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:91:13
         const reactions: FootprintReaction[] = await em.find('FootprintReaction', { footprint: { id } } as any)
         await em.persistAndFlush(reaction)
         // TODO: rewrite to "isFirstReaction"
-        if (reactions) {
+        if (true) {
             if (footprint.createdBy.id === user.id) {
                 return {

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:91:13
         const reactions: FootprintReaction[] = await em.find('FootprintReaction', { footprint: { id } } as any)
         await em.persistAndFlush(reaction)
         // TODO: rewrite to "isFirstReaction"
-        if (reactions) {
+        if (false) {
             if (footprint.createdBy.id === user.id) {
                 return {

[NoCoverage] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:92:53
         await em.persistAndFlush(reaction)
         // TODO: rewrite to "isFirstReaction"
         if (reactions) {
-            if (footprint.createdBy.id === user.id) {
-                return {
-                    reaction,
-                }
-            }
+            if (footprint.createdBy.id === user.id) {}
             const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
             if (reactionsByUser.length > 0) {

[NoCoverage] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:92:17
         await em.persistAndFlush(reaction)
         // TODO: rewrite to "isFirstReaction"
         if (reactions) {
-            if (footprint.createdBy.id === user.id) {
+            if (footprint.createdBy.id !== user.id) {
                 return {
                     reaction,

[NoCoverage] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:93:24
         // TODO: rewrite to "isFirstReaction"
         if (reactions) {
             if (footprint.createdBy.id === user.id) {
-                return {
-                    reaction,
-                }
+                return {}
             }
             const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)

[NoCoverage] ArrowFunction
src/repositories/footprint/footprintPostgresRepository.ts:97:54
                     reaction,
                 }
             }
-            const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
+            const reactionsByUser = reactions.filter(() => undefined)
             if (reactionsByUser.length > 0) {
                 return {

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:97:63
                     reaction,
                 }
             }
-            const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
+            const reactionsByUser = reactions.filter(react => false)
             if (reactionsByUser.length > 0) {
                 return {

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:98:17
                 }
             }
             const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
-            if (reactionsByUser.length > 0) {
+            if (true) {
                 return {
                     reaction,

[NoCoverage] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:98:17
                 }
             }
             const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
-            if (reactionsByUser.length > 0) {
+            if (reactionsByUser.length >= 0) {
                 return {
                     reaction,

[NoCoverage] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:99:24
             }
             const reactionsByUser = reactions.filter(react => react.createdBy.id === user.id)
             if (reactionsByUser.length > 0) {
-                return {
-                    reaction,
-                }
+                return {}
             }
         }

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:112:84
         }
     }
 
-    deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }) => {
-        const em = this.orm.forkEm()
-        const footprint = await this.findFootprintById(id)
-        if (footprint.createdBy.uid !== uid) {
-            throw new ForbiddenError()
-        }
-        const reactions = await em.find(
-            'FootprintReaction',
-            { footprint },
-        )
-        em.remove(reactions)
-        return Promise.all([
-            this.deletionService.deleteFilesOfOneFootprint(footprint.audioURL, footprint.imageURL),
-            em.removeAndFlush(footprint),
-        ])
-    }
+    deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }) => {}
 
     deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }) => {
killedBy: FootprintPostgresRepository deleteFootprint deletes a footprint with its reactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:115:46
     deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }) => {
         const em = this.orm.forkEm()
         const footprint = await this.findFootprintById(id)
-        if (footprint.createdBy.uid !== uid) {
-            throw new ForbiddenError()
-        }
+        if (footprint.createdBy.uid !== uid) {}
         const reactions = await em.find(
             'FootprintReaction',
killedBy: FootprintPostgresRepository deleteFootprint throws an error if user is not the owner of the footprint
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ForbiddenError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'find')"

      213 |         }

[Killed] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:115:13
     deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }) => {
         const em = this.orm.forkEm()
         const footprint = await this.findFootprintById(id)
-        if (footprint.createdBy.uid !== uid) {
+        if (footprint.createdBy.uid === uid) {
             throw new ForbiddenError()
         }
killedBy: FootprintPostgresRepository deleteFootprint deletes a footprint with its reactions
statusReason: Error

[Killed] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:120:13
         }
         const reactions = await em.find(
             'FootprintReaction',
-            { footprint },
+            {},
         )
         em.remove(reactions)
killedBy: FootprintPostgresRepository deleteFootprint deletes a footprint with its reactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "FootprintReaction",
- Object {
-   "footprint": Object {

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:129:92
         ])
     }
 
-    deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }) => {
-        const em = this.orm.forkEm()
-        const reaction: FootprintReaction = await em.findOneOrFail(
-            'FootprintReaction',
-            { id } as any,
-            {
-                populate: ['createdBy'],
-                failHandler: () => { throw new NotFoundError() },
-            } as any,
-        )
-        if (reaction.createdBy.uid !== uid) {
-            throw new ForbiddenError()
-        }
-        return em.removeAndFlush(reaction)
-    }
+    deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }) => {}
 
     getAllFootprints = async () => {
killedBy: FootprintPostgresRepository deleteFootprintReaction deletes a footprint reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/repositories/footprint/footprintPostgresRepository.ts:132:13
     deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }) => {
         const em = this.orm.forkEm()
         const reaction: FootprintReaction = await em.findOneOrFail(
-            'FootprintReaction',
+            "",
             { id } as any,
             {
killedBy: FootprintPostgresRepository deleteFootprintReaction deletes a footprint reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "FootprintReaction",
+ "",
  {"id": 1},

[Killed] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:139:13
                 failHandler: () => { throw new NotFoundError() },
             } as any,
         )
-        if (reaction.createdBy.uid !== uid) {
+        if (false) {
             throw new ForbiddenError()
         }
killedBy: FootprintPostgresRepository deleteFootprintReaction throws an ForbiddenError if user is not the owner of the footprint reaction
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ForbiddenError
Received constructor: TypeError

Received message: "em.removeAndFlush is not a function"

      248 |         }

[Killed] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:139:13
                 failHandler: () => { throw new NotFoundError() },
             } as any,
         )
-        if (reaction.createdBy.uid !== uid) {
+        if (reaction.createdBy.uid === uid) {
             throw new ForbiddenError()
         }
killedBy: FootprintPostgresRepository deleteFootprintReaction deletes a footprint reaction
statusReason: Error

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:145:36
         return em.removeAndFlush(reaction)
     }
 
-    getAllFootprints = async () => {
-        const em = this.orm.forkEm()
-        return em.getRepository('Footprint').findAll({ populate: ['createdBy'] } as any)
-    }
+    getAllFootprints = async () => {}
 
     getFootprintsOfFriendsAndUser = async (uid: string) => {
killedBy: FootprintPostgresRepository returns all footprints
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:150:60
         return em.getRepository('Footprint').findAll({ populate: ['createdBy'] } as any)
     }
 
-    getFootprintsOfFriendsAndUser = async (uid: string) => {
-        const em = this.orm.forkEm()
-        const user = await this.userRepository.getUserByUid(uid)
-        const friendships = await this.friendshipRepository.getFriendshipsWithSpecifiedOptions(
-            user,
-            { status: FriendshipStatus.ACCEPTED },
-            { fields: [{ invitor: ['id'] }, { invitee: ['id'] }] },
-        )
-        const friends = friendships.map(
-            friendship => (friendship.invitor.id === user.id ? friendship.invitee.id : friendship.invitor.id),
-        )
-        const footprints: Footprint[] = await em.find(
-            'Footprint',
-            { createdBy: [ user, ...friends ] } as any,
-            { populate: [ 'createdBy', 'users' ] } as any,
-        )
-
-        return footprints.map((footprint) => {
-            const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
-            return { ...footprint, hasVisited }
-        })
-    }
+    getFootprintsOfFriendsAndUser = async (uid: string) => {}
 
     getFootprintById = async (uid: string, id: string | number) => {

[NoCoverage] ArrayDeclaration
src/repositories/footprint/footprintPostgresRepository.ts:156:23
         const friendships = await this.friendshipRepository.getFriendshipsWithSpecifiedOptions(
             user,
             { status: FriendshipStatus.ACCEPTED },
-            { fields: [{ invitor: ['id'] }, { invitee: ['id'] }] },
+            { fields: [] },
         )
         const friends = friendships.map(

[NoCoverage] StringLiteral
src/repositories/footprint/footprintPostgresRepository.ts:156:57
         const friendships = await this.friendshipRepository.getFriendshipsWithSpecifiedOptions(
             user,
             { status: FriendshipStatus.ACCEPTED },
-            { fields: [{ invitor: ['id'] }, { invitee: ['id'] }] },
+            { fields: [{ invitor: ['id'] }, { invitee: [""] }] },
         )
         const friends = friendships.map(

[NoCoverage] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:159:28
             { fields: [{ invitor: ['id'] }, { invitee: ['id'] }] },
         )
         const friends = friendships.map(
-            friendship => (friendship.invitor.id === user.id ? friendship.invitee.id : friendship.invitor.id),
+            friendship => (friendship.invitor.id !== user.id ? friendship.invitee.id : friendship.invitor.id),
         )
         const footprints: Footprint[] = await em.find(

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:159:28
             { fields: [{ invitor: ['id'] }, { invitee: ['id'] }] },
         )
         const friends = friendships.map(
-            friendship => (friendship.invitor.id === user.id ? friendship.invitee.id : friendship.invitor.id),
+            friendship => (false ? friendship.invitee.id : friendship.invitor.id),
         )
         const footprints: Footprint[] = await em.find(

[NoCoverage] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:167:46
             { populate: [ 'createdBy', 'users' ] } as any,
         )
 
-        return footprints.map((footprint) => {
-            const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
-            return { ...footprint, hasVisited }
-        })
+        return footprints.map((footprint) => {})
     }
 

[NoCoverage] LogicalOperator
src/repositories/footprint/footprintPostgresRepository.ts:168:32
         )
 
         return footprints.map((footprint) => {
-            const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
+            const hasVisited = footprint.users.getIdentifiers('id').includes(user.id) && footprint.createdBy.id === user.id
             return { ...footprint, hasVisited }
         })

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:168:32
         )
 
         return footprints.map((footprint) => {
-            const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
+            const hasVisited = false
             return { ...footprint, hasVisited }
         })

[NoCoverage] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:169:20
 
         return footprints.map((footprint) => {
             const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
+                || false
             return { ...footprint, hasVisited }
         })

[NoCoverage] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:169:20
 
         return footprints.map((footprint) => {
             const hasVisited = footprint.users.getIdentifiers('id').includes(user.id)
-                || footprint.createdBy.id === user.id
+                || footprint.createdBy.id !== user.id
             return { ...footprint, hasVisited }
         })

[Killed] ArrayDeclaration
src/repositories/footprint/footprintPostgresRepository.ts:176:55
 
     getFootprintById = async (uid: string, id: string | number) => {
         const em = this.orm.forkEm()
-        const [ footprint, user ] = await Promise.all([
-            this.findFootprintById(id),
-            this.userRepository.getUserByUid(uid),
-        ])
+        const [ footprint, user ] = await Promise.all([])
         if (!footprint.users.isInitialized()) {
             await footprint.users.init()
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (myFootprint - no points)
statusReason: TypeError: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:180:13
             this.findFootprintById(id),
             this.userRepository.getUserByUid(uid),
         ])
-        if (!footprint.users.isInitialized()) {
+        if (true) {
             await footprint.users.init()
         }
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (myFootprint - no points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:180:13
             this.findFootprintById(id),
             this.userRepository.getUserByUid(uid),
         ])
-        if (!footprint.users.isInitialized()) {
+        if (false) {
             await footprint.users.init()
         }
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (myFootprint - no points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
src/repositories/footprint/footprintPostgresRepository.ts:183:27
         if (!footprint.users.isInitialized()) {
             await footprint.users.init()
         }
-        let myFootprint = true
+        let myFootprint = false
         if (footprint.createdBy.id !== user.id) {
             myFootprint = false

[Killed] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:184:13
             await footprint.users.init()
         }
         let myFootprint = true
-        if (footprint.createdBy.id !== user.id) {
+        if (false) {
             myFootprint = false
             footprint.users.add(user)
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "123", "points": 10, "uid": "abc"}

Number of calls: 0

[Killed] EqualityOperator
src/repositories/footprint/footprintPostgresRepository.ts:184:13
             await footprint.users.init()
         }
         let myFootprint = true
-        if (footprint.createdBy.id !== user.id) {
+        if (footprint.createdBy.id === user.id) {
             myFootprint = false
             footprint.users.add(user)
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": "123", "points": 10, "uid": "abc"}

Number of calls: 0

[Killed] BooleanLiteral
src/repositories/footprint/footprintPostgresRepository.ts:185:27
         }
         let myFootprint = true
         if (footprint.createdBy.id !== user.id) {
-            myFootprint = false
+            myFootprint = true
             footprint.users.add(user)
         }
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"id": "456"}, "id": "1", "users": {"add": [Function mockConstructor], "init": [Function mockConstructor], "isInitialized": [Function mockConstructor]}}

Number of calls: 0

[Killed] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:188:13
             myFootprint = false
             footprint.users.add(user)
         }
-        if (myFootprint) {
+        if (true) {
             return {
                 footprint,
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdBy": {"id": "456"}, "id": "1", "users": {"add": [Function mockConstructor], "init": [Function mockConstructor], "isInitialized": [Function mockConstructor]}}

Number of calls: 0

[Survived] ConditionalExpression
src/repositories/footprint/footprintPostgresRepository.ts:188:13
             myFootprint = false
             footprint.users.add(user)
         }
-        if (myFootprint) {
+        if (false) {
             return {
                 footprint,

[Killed] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:189:20
             footprint.users.add(user)
         }
         if (myFootprint) {
-            return {
-                footprint,
-            }
+            return {}
         }
         try {
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (myFootprint - no points)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  +  1

- Object {
-   "footprint": Object {
-     "createdBy": Object {

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:193:13
                 footprint,
             }
         }
-        try {
-            await em.persistAndFlush(footprint)
-            const userWithUpdatedPoints = await this.userRepository.addPoints(uid, Points.FOOTPRINT_VIEWED)
-            return {
-                footprint: await this.findFootprintById(id),
-                points: Points.FOOTPRINT_VIEWED,
-                userPoints: userWithUpdatedPoints.points,
-            }
-        } catch {
+        try {} catch {
             return {
                 footprint,
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: TypeError: Cannot read properties of undefined (reading 'footprint')

[Killed] ObjectLiteral
src/repositories/footprint/footprintPostgresRepository.ts:196:20
         try {
             await em.persistAndFlush(footprint)
             const userWithUpdatedPoints = await this.userRepository.addPoints(uid, Points.FOOTPRINT_VIEWED)
-            return {
-                footprint: await this.findFootprintById(id),
-                points: Points.FOOTPRINT_VIEWED,
-                userPoints: userWithUpdatedPoints.points,
-            }
+            return {}
         } catch {
             return {
killedBy: FootprintPostgresRepository getFootprintById return one footprint by id (notMyFootprint - points)
statusReason: TypeError: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:201:17
                 points: Points.FOOTPRINT_VIEWED,
                 userPoints: userWithUpdatedPoints.points,
             }
-        } catch {
-            return {
-                footprint,
-            }
-        }
+        } catch {}
     }
 
killedBy: FootprintPostgresRepository getFootprintById return footprint if error is thrown
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"footprint": {"createdBy": {"id": "456"}, "id": "1", "users": {"add": [Function mockConstructor], "init": [Function mockConstructor], "isInitialized": [Function mockConstructor]}}}
Received: undefined

[Killed] BlockStatement
src/repositories/footprint/footprintPostgresRepository.ts:208:60
         }
     }
 
-    getFootprintReactions = async (id: number | string) => {
-        const em = this.orm.forkEm()
-        return em.find(
-            'FootprintReaction',
-            { footprint: { id } } as any,
-            { populate: ['createdBy'] } as any,
-        )
-    }
+    getFootprintReactions = async (id: number | string) => {}
 }
 
killedBy: FootprintPostgresRepository returns all reactions of a footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
