[Killed] BlockStatement
src/config/actuatorConfig.ts:7:68
     customEndpoints: [
         {
             id: 'health-plain',
-            controller: (_request: Request, response: Response) => {
-                response.status(200).send('UP')
-            },
+            controller: (_request: Request, response: Response) => {},
         },
     ],
killedBy: actuatorConfig export custom health route with plain "UP" text
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0
