[Killed] BlockStatement
src/services/userService.ts:9:48
 const MAX_FRIENDS_CODES = 36 ** FRIENDS_CODE_LENGTH - 1
 
 export class UserService {
-    numberToBase36String = (number: number) => {
-        if (number < 0) {
-            throw new NegativeNumbersNotAllowedError()
-        }
-
-        if (number > MAX_FRIENDS_CODES) {
-            throw new MaximumFriendsCodeLimitExceededError()
-        }
-
-        return number.toString(36).padStart(FRIENDS_CODE_LENGTH, '0').toUpperCase()
-    }
+    numberToBase36String = (number: number) => {}
 }
 
killedBy: UserService returns positiv decimal number 0 as 5-letter base 36 upper case string "00000"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00000"
Received: undefined

[Killed] ConditionalExpression
src/services/userService.ts:10:13
 
 export class UserService {
     numberToBase36String = (number: number) => {
-        if (number < 0) {
+        if (false) {
             throw new NegativeNumbersNotAllowedError()
         }
killedBy: UserService returns error for negativ decimal numbers
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: NegativeNumbersNotAllowedError

Received function did not throw

[Killed] ConditionalExpression
src/services/userService.ts:10:13
 
 export class UserService {
     numberToBase36String = (number: number) => {
-        if (number < 0) {
+        if (true) {
             throw new NegativeNumbersNotAllowedError()
         }
killedBy: UserService returns positiv decimal number 0 as 5-letter base 36 upper case string "00000"
statusReason: Error

[Killed] EqualityOperator
src/services/userService.ts:14:13
             throw new NegativeNumbersNotAllowedError()
         }
 
-        if (number > MAX_FRIENDS_CODES) {
+        if (number <= MAX_FRIENDS_CODES) {
             throw new MaximumFriendsCodeLimitExceededError()
         }
killedBy: UserService returns positiv decimal number 0 as 5-letter base 36 upper case string "00000"
statusReason: Error

[Killed] ConditionalExpression
src/services/userService.ts:14:13
             throw new NegativeNumbersNotAllowedError()
         }
 
-        if (number > MAX_FRIENDS_CODES) {
+        if (true) {
             throw new MaximumFriendsCodeLimitExceededError()
         }
killedBy: UserService returns positiv decimal number 0 as 5-letter base 36 upper case string "00000"
statusReason: Error

[Killed] MethodExpression
src/services/userService.ts:18:16
             throw new MaximumFriendsCodeLimitExceededError()
         }
 
-        return number.toString(36).padStart(FRIENDS_CODE_LENGTH, '0').toUpperCase()
+        return number.toString(36).padStart(FRIENDS_CODE_LENGTH, '0').toLowerCase()
     }
 }
killedBy: UserService returns positiv decimal number 35 as 5-letter base 36 upper case string "0000Z"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0000Z"
Received: "0000z"

[Killed] StringLiteral
src/services/userService.ts:18:66
             throw new MaximumFriendsCodeLimitExceededError()
         }
 
-        return number.toString(36).padStart(FRIENDS_CODE_LENGTH, '0').toUpperCase()
+        return number.toString(36).padStart(FRIENDS_CODE_LENGTH, "").toUpperCase()
     }
 }
killedBy: UserService returns positiv decimal number 0 as 5-letter base 36 upper case string "00000"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "00000"
Received: "0"
