[Killed] BlockStatement
src/application.ts:23:55
 
     port: number
 
-    constructor(orm: ORM, server: ExpressApplication) {
-        this.orm = orm
-        this.server = server
-        this.router = new Router(this.server, this.orm)
-        this.port = Number.parseInt(process.env.PORT as string, 10)
-        initializeApp({
-            credential: cert(serviceAccountConfig),
-            storageBucket: `gs://${process.env.FIREBASE_STORAGE_BUCKET}/`,
-        })
-        this.initSentry()
-    }
+    constructor(orm: ORM, server: ExpressApplication) {}
 
     initSentry(): void {
killedBy: Application constructor initializes the firebase admin app
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"credential": "cert", "storageBucket": "gs://storage_bucket/"}

Number of calls: 0

[Killed] BlockStatement
src/application.ts:35:24
         this.initSentry()
     }
 
-    initSentry(): void {
-        Sentry.init({
-            dsn: process.env.SENTRY_DSN,
-            integrations: [
-                // enable HTTP calls tracing
-                new Sentry.Integrations.Http({ tracing: true }),
-                // enable Express.js middleware tracing
-                new Tracing.Integrations.Express({ app: this.server }),
-            ],
-
-            tracesSampleRate: 1,
-            release: `friendsquest-api@${process.env.npm_package_version}`,
-        })
-    }
+    initSentry(): void {}
 
     migrate = async (): Promise<void> => {
killedBy: Application initSentry initializes sentry
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dsn": "sentry_dsn", "integrations": Any<Array>, "release": Any<String>, "tracesSampleRate": 1}

Number of calls: 0

[Killed] ObjectLiteral
src/application.ts:36:21
     }
 
     initSentry(): void {
-        Sentry.init({
-            dsn: process.env.SENTRY_DSN,
-            integrations: [
-                // enable HTTP calls tracing
-                new Sentry.Integrations.Http({ tracing: true }),
-                // enable Express.js middleware tracing
-                new Tracing.Integrations.Express({ app: this.server }),
-            ],
-
-            tracesSampleRate: 1,
-            release: `friendsquest-api@${process.env.npm_package_version}`,
-        })
+        Sentry.init({})
     }
 
killedBy: Application initSentry initializes sentry
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dsn": "sentry_dsn", "integrations": Any<Array>, "release": Any<String>, "tracesSampleRate": 1}
Received: {}

Number of calls: 1

[Survived] BooleanLiteral
src/application.ts:40:57
             dsn: process.env.SENTRY_DSN,
             integrations: [
                 // enable HTTP calls tracing
-                new Sentry.Integrations.Http({ tracing: true }),
+                new Sentry.Integrations.Http({ tracing: false }),
                 // enable Express.js middleware tracing
                 new Tracing.Integrations.Express({ app: this.server }),

[Killed] BlockStatement
src/application.ts:50:42
         })
     }
 
-    migrate = async (): Promise<void> => {
-        try {
-            const migrator = this.orm.orm.getMigrator()
-            const migrations = await migrator.getPendingMigrations()
-            if (migrations && migrations.length > 0) {
-                await migrator.up()
-            }
-        } catch (error: any) {
-            console.error(`Error occurred: ${error.message}`)
-        }
-    }
+    migrate = async (): Promise<void> => {}
 
     init = async (): Promise<http.Server | undefined> => {
killedBy: Application connect migrates pending migrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/application.ts:51:13
     }
 
     migrate = async (): Promise<void> => {
-        try {
-            const migrator = this.orm.orm.getMigrator()
-            const migrations = await migrator.getPendingMigrations()
-            if (migrations && migrations.length > 0) {
-                await migrator.up()
-            }
-        } catch (error: any) {
+        try {} catch (error: any) {
             console.error(`Error occurred: ${error.message}`)
         }
killedBy: Application connect migrates pending migrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/application.ts:54:17
         try {
             const migrator = this.orm.orm.getMigrator()
             const migrations = await migrator.getPendingMigrations()
-            if (migrations && migrations.length > 0) {
+            if (migrations || migrations.length > 0) {
                 await migrator.up()
             }
killedBy: Application connect migrates pending migrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
src/application.ts:54:31
         try {
             const migrator = this.orm.orm.getMigrator()
             const migrations = await migrator.getPendingMigrations()
-            if (migrations && migrations.length > 0) {
+            if (migrations && true) {
                 await migrator.up()
             }
killedBy: Application connect migrates pending migrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] BlockStatement
src/application.ts:57:30
             if (migrations && migrations.length > 0) {
                 await migrator.up()
             }
-        } catch (error: any) {
-            console.error(`Error occurred: ${error.message}`)
-        }
+        } catch (error: any) {}
     }
 
killedBy: Application connect prints an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error occurred: test"

Number of calls: 0

[Killed] BlockStatement
src/application.ts:62:58
         }
     }
 
-    init = async (): Promise<http.Server | undefined> => {
-        await this.migrate()
-
-        this.server.use(json())
-        this.server.use(urlencoded({ extended: true }))
-        this.server.use(helmet())
-        this.server.use(cors())
-        this.server.use(compression())
-        this.server.use(Sentry.Handlers.requestHandler())
-        this.server.use(Sentry.Handlers.tracingHandler())
-
-        this.server.disable('x-powered-by')
-
-        this.router.initRoutes(routes)
-
-        try {
-            return this.server.listen(this.port)
-        } catch (error: any) {
-            console.error('Could not start server', error)
-            return undefined
-        }
-    }
+    init = async (): Promise<http.Server | undefined> => {}
 }
 
killedBy: Application init calls migrations
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/application.ts:66:48
         await this.migrate()
 
         this.server.use(json())
-        this.server.use(urlencoded({ extended: true }))
+        this.server.use(urlencoded({ extended: false }))
         this.server.use(helmet())
         this.server.use(cors())
killedBy: Application init sets up global middlewares
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"extended": true}
Received
       1
          Object {
        -   "extended": true,
        +   "extended": false,

[Killed] StringLiteral
src/application.ts:73:29
         this.server.use(Sentry.Handlers.requestHandler())
         this.server.use(Sentry.Handlers.tracingHandler())
 
-        this.server.disable('x-powered-by')
+        this.server.disable("")
 
         this.router.initRoutes(routes)
killedBy: Application init disables "x-powered-by" header
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "x-powered-by"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/application.ts:77:13
 
         this.router.initRoutes(routes)
 
-        try {
-            return this.server.listen(this.port)
-        } catch (error: any) {
+        try {} catch (error: any) {
             console.error('Could not start server', error)
             return undefined
killedBy: Application init starts the server
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1234

Number of calls: 0

[Killed] BlockStatement
src/application.ts:79:30
 
         try {
             return this.server.listen(this.port)
-        } catch (error: any) {
-            console.error('Could not start server', error)
-            return undefined
-        }
+        } catch (error: any) {}
     }
 }
killedBy: Application init throws an error if server cannot be started
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Could not start server", [Error: test]

Number of calls: 0

[Killed] StringLiteral
src/application.ts:80:27
         try {
             return this.server.listen(this.port)
         } catch (error: any) {
-            console.error('Could not start server', error)
+            console.error("", error)
             return undefined
         }
killedBy: Application init throws an error if server cannot be started
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Could not start server", [Error: test]
Received: "", [Error: test]

Number of calls: 1
