[Killed] BlockStatement
src/controller/footprintController.ts:12:68
 export class FootprintController {
     private footprintRepository: FootprintRepositoryInterface
 
-    constructor(footprintRepository: FootprintRepositoryInterface) {
-        this.footprintRepository = footprintRepository
-    }
+    constructor(footprintRepository: FootprintRepositoryInterface) {}
 
     getAllFootprints = async (response: Response) => {
killedBy: FootprintController getAllFootprints returns all footprints
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/footprintController.ts:16:54
         this.footprintRepository = footprintRepository
     }
 
-    getAllFootprints = async (response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.footprintRepository.getAllFootprints())
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getAllFootprints = async (response: Response) => {}
 
     getFootprintsOfFriendsAndUser = async ({ uid }: { uid: string }, response: Response) => {
killedBy: FootprintController getAllFootprints returns all footprints
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/footprintController.ts:17:13
     }
 
     getAllFootprints = async (response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.footprintRepository.getAllFootprints())
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController getAllFootprints returns all footprints
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/footprintController.ts:19:30
     getAllFootprints = async (response: Response) => {
         try {
             return ResponseSender.result(response, 200, await this.footprintRepository.getAllFootprints())
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: FootprintController getAllFootprints sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:24:93
         }
     }
 
-    getFootprintsOfFriendsAndUser = async ({ uid }: { uid: string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.footprintRepository.getFootprintsOfFriendsAndUser(uid),
-            )
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getFootprintsOfFriendsAndUser = async ({ uid }: { uid: string }, response: Response) => {}
 
     getFootprintById = async ({ uid, id }: { uid: string, id: number | string }, response: Response) => {
killedBy: FootprintController getFootprintsOfFriendsAndUser returns footprints in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "uid"

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:25:13
     }
 
     getFootprintsOfFriendsAndUser = async ({ uid }: { uid: string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.footprintRepository.getFootprintsOfFriendsAndUser(uid),
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController getFootprintsOfFriendsAndUser returns footprints in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "uid"

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:36:105
         }
     }
 
-    getFootprintById = async ({ uid, id }: { uid: string, id: number | string }, response: Response) => {
-        try {
-            const { footprint, points, userPoints } = await this.footprintRepository.getFootprintById(uid, id)
-            return ResponseSender.result(response, 200, footprint, { amount: points, total: userPoints })
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getFootprintById = async ({ uid, id }: { uid: string, id: number | string }, response: Response) => {}
 
     getFootprintReactions = async ({ id }: { id: number | string }, response: Response) => {
killedBy: FootprintController getFootprintById returns footprint in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc", 1

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:37:13
     }
 
     getFootprintById = async ({ uid, id }: { uid: string, id: number | string }, response: Response) => {
-        try {
-            const { footprint, points, userPoints } = await this.footprintRepository.getFootprintById(uid, id)
-            return ResponseSender.result(response, 200, footprint, { amount: points, total: userPoints })
-        } catch (error: any) {
+        try {} catch (error: any) {
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
killedBy: FootprintController getFootprintById returns footprint in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc", 1

Number of calls: 0

[Killed] ObjectLiteral
src/controller/footprintController.ts:39:68
     getFootprintById = async ({ uid, id }: { uid: string, id: number | string }, response: Response) => {
         try {
             const { footprint, points, userPoints } = await this.footprintRepository.getFootprintById(uid, id)
-            return ResponseSender.result(response, 200, footprint, { amount: points, total: userPoints })
+            return ResponseSender.result(response, 200, footprint, {})
         } catch (error: any) {
             if (error instanceof NotFoundError) {
killedBy: FootprintController getFootprintById returns footprint in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  200,
  "sample",

[Killed] BlockStatement
src/controller/footprintController.ts:40:30
         try {
             const { footprint, points, userPoints } = await this.footprintRepository.getFootprintById(uid, id)
             return ResponseSender.result(response, 200, footprint, { amount: points, total: userPoints })
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: FootprintController getFootprintById sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:41:49
             const { footprint, points, userPoints } = await this.footprintRepository.getFootprintById(uid, id)
             return ResponseSender.result(response, 200, footprint, { amount: points, total: userPoints })
         } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
-            }
+            if (error instanceof NotFoundError) {}
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController getFootprintById sends an error if footprint not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "The footprint you are looking for does not exist.",

[Killed] BlockStatement
src/controller/footprintController.ts:48:92
         }
     }
 
-    getFootprintReactions = async ({ id }: { id: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.footprintRepository.getFootprintReactions(id),
-            )
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getFootprintReactions = async ({ id }: { id: number | string }, response: Response) => {}
 
     createFootprintReaction = async (
killedBy: FootprintController getFootprintReactions returns footprint reactions in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:49:13
     }
 
     getFootprintReactions = async ({ id }: { id: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.footprintRepository.getFootprintReactions(id),
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController getFootprintReactions returns footprint reactions in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:63:10
     createFootprintReaction = async (
         { id, message, uid }: { id: number | string, message: string, uid: string },
         response: Response,
-    ) => {
-        try {
-            const { reaction, points, userPoints } = await this.footprintRepository.createFootprintReaction({
-                id,
-                message,
-                uid,
-            })
-            const reactionWithFootprintId = {
-                ...reaction,
-                footprint: reaction.footprint.id,
-            }
-            return ResponseSender.result(
-                response,
-                201,
-                reactionWithFootprintId,
-                { amount: points, total: userPoints },
-            )
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    ) => {}
 
     deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
killedBy: FootprintController createFootprintReaction creates reaction and returns footprint id with reaction in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "message": "sample", "uid": "abcdef"}

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:64:13
         { id, message, uid }: { id: number | string, message: string, uid: string },
         response: Response,
     ) => {
-        try {
-            const { reaction, points, userPoints } = await this.footprintRepository.createFootprintReaction({
-                id,
-                message,
-                uid,
-            })
-            const reactionWithFootprintId = {
-                ...reaction,
-                footprint: reaction.footprint.id,
-            }
-            return ResponseSender.result(
-                response,
-                201,
-                reactionWithFootprintId,
-                { amount: points, total: userPoints },
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController createFootprintReaction creates reaction and returns footprint id with reaction in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "message": "sample", "uid": "abcdef"}

Number of calls: 0

[Killed] ObjectLiteral
src/controller/footprintController.ts:70:45
                 message,
                 uid,
             })
-            const reactionWithFootprintId = {
-                ...reaction,
-                footprint: reaction.footprint.id,
-            }
+            const reactionWithFootprintId = {}
             return ResponseSender.result(
                 response,
killedBy: FootprintController createFootprintReaction creates reaction and returns footprint id with reaction in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  201,
- Object {

[Killed] BlockStatement
src/controller/footprintController.ts:85:104
         }
     }
 
-    deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            await this.footprintRepository.deleteFootprint({ id, uid })
-            return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
-            }
-            if (error instanceof ForbiddenError) {
-                // eslint-disable-next-line max-len
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete footprints of others'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {}
 
     deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
killedBy: FootprintController deleteFootprint deletes a footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 12, "uid": "uid"}

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:86:13
     }
 
     deleteFootprint = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            await this.footprintRepository.deleteFootprint({ id, uid })
-            return response.sendStatus(204)
-        } catch (error: any) {
+        try {} catch (error: any) {
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
killedBy: FootprintController deleteFootprint deletes a footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 12, "uid": "uid"}

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:89:30
         try {
             await this.footprintRepository.deleteFootprint({ id, uid })
             return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
-            }
-            if (error instanceof ForbiddenError) {
-                // eslint-disable-next-line max-len
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete footprints of others'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: FootprintController deleteFootprint sends an NotFoundError if footprint is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] StringLiteral
src/controller/footprintController.ts:91:86
             return response.sendStatus(204)
         } catch (error: any) {
             if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
+                return ResponseSender.error(response, NotFoundError.getErrorDocument(""))
             }
             if (error instanceof ForbiddenError) {
killedBy: FootprintController deleteFootprint sends an NotFoundError if footprint is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "The footprint you are looking for does not exist.",

[Killed] BlockStatement
src/controller/footprintController.ts:93:50
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
             }
-            if (error instanceof ForbiddenError) {
-                // eslint-disable-next-line max-len
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete footprints of others'))
-            }
+            if (error instanceof ForbiddenError) {}
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController deleteFootprint sends an ForbiddenError if user is not allowed to delete footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
    "detail": "You cannot delete footprints of others",

[Killed] ConditionalExpression
src/controller/footprintController.ts:93:17
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The footprint'))
             }
-            if (error instanceof ForbiddenError) {
+            if (true) {
                 // eslint-disable-next-line max-len
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete footprints of others'))
killedBy: FootprintController deleteFootprint sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "test",

[Killed] BlockStatement
src/controller/footprintController.ts:101:112
         }
     }
 
-    deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            await this.footprintRepository.deleteFootprintReaction({ id, uid })
-            return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
-            }
-            if (error instanceof ForbiddenError) {
-                // eslint-disable-next-line max-len
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete reactions of others'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {}
 
     createFootprint = async (
killedBy: FootprintController deleteFootprintReaction deletes a footprint reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 12, "uid": "uid"}

Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:102:13
     }
 
     deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
-        try {
-            await this.footprintRepository.deleteFootprintReaction({ id, uid })
-            return response.sendStatus(204)
-        } catch (error: any) {
+        try {} catch (error: any) {
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
killedBy: FootprintController deleteFootprintReaction deletes a footprint reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 12, "uid": "uid"}

Number of calls: 0

[Killed] ObjectLiteral
src/controller/footprintController.ts:103:68
 
     deleteFootprintReaction = async ({ id, uid }: { id: number | string, uid: string }, response: Response) => {
         try {
-            await this.footprintRepository.deleteFootprintReaction({ id, uid })
+            await this.footprintRepository.deleteFootprintReaction({})
             return response.sendStatus(204)
         } catch (error: any) {
killedBy: FootprintController deleteFootprintReaction deletes a footprint reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": 12,
-   "uid": "uid",

[Killed] BlockStatement
src/controller/footprintController.ts:105:30
         try {
             await this.footprintRepository.deleteFootprintReaction({ id, uid })
             return response.sendStatus(204)
-        } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
-            }
-            if (error instanceof ForbiddenError) {
-                // eslint-disable-next-line max-len
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete reactions of others'))
-            }
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: FootprintController deleteFootprintReaction sends an NotFoundError if reaction is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/footprintController.ts:106:49
             await this.footprintRepository.deleteFootprintReaction({ id, uid })
             return response.sendStatus(204)
         } catch (error: any) {
-            if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
-            }
+            if (error instanceof NotFoundError) {}
             if (error instanceof ForbiddenError) {
                 // eslint-disable-next-line max-len
killedBy: FootprintController deleteFootprintReaction sends an NotFoundError if reaction is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "The reaction you are looking for does not exist.",

[Killed] StringLiteral
src/controller/footprintController.ts:107:86
             return response.sendStatus(204)
         } catch (error: any) {
             if (error instanceof NotFoundError) {
-                return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
+                return ResponseSender.error(response, NotFoundError.getErrorDocument(""))
             }
             if (error instanceof ForbiddenError) {
killedBy: FootprintController deleteFootprintReaction sends an NotFoundError if reaction is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "The reaction you are looking for does not exist.",

[Killed] ConditionalExpression
src/controller/footprintController.ts:109:17
             if (error instanceof NotFoundError) {
                 return ResponseSender.error(response, NotFoundError.getErrorDocument('The reaction'))
             }
-            if (error instanceof ForbiddenError) {
+            if (false) {
                 // eslint-disable-next-line max-len
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument('You cannot delete reactions of others'))
killedBy: FootprintController deleteFootprintReaction sends an ForbiddenError if user is not allowed to delete reaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
    "detail": "You cannot delete reactions of others",

[Killed] BlockStatement
src/controller/footprintController.ts:121:13
         { title, description, latitude, longitude, files, uid }: NewFootprint,
         response: Response,
     ) => {
-        try {
-            const { footprint, points, userPoints } = await this.footprintRepository.createFootprint({
-                title,
-                description,
-                latitude,
-                longitude,
-                files,
-                uid,
-            })
-            const footprintWithCoordinatesAsNumbers = {
-                ...footprint,
-                longitude: Number(footprint.longitude),
-                latitude: Number(footprint.latitude),
-            }
-
-            return ResponseSender.result(
-                response,
-                201,
-                footprintWithCoordinatesAsNumbers,
-                { amount: points, total: userPoints },
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: FootprintController createFootprint creates footprint and returns footprint with coordinates as numbers in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"files": {"audio": [], "image": []}, "latitude": "1", "longitude": "2", "title": "a", "uid": "a"}

Number of calls: 0

[Killed] ObjectLiteral
src/controller/footprintController.ts:122:102
         response: Response,
     ) => {
         try {
-            const { footprint, points, userPoints } = await this.footprintRepository.createFootprint({
-                title,
-                description,
-                latitude,
-                longitude,
-                files,
-                uid,
-            })
+            const { footprint, points, userPoints } = await this.footprintRepository.createFootprint({})
             const footprintWithCoordinatesAsNumbers = {
                 ...footprint,
killedBy: FootprintController createFootprint creates footprint and returns footprint with coordinates as numbers in response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "files": Object {
-     "audio": Array [],
