[Killed] BlockStatement
src/controller/leaderboardController.ts:9:72
 export class LeaderboardController {
     private readonly leaderboardRepository: LeaderboardRepositoryInterface
 
-    constructor(leaderboardRepository: LeaderboardRepositoryInterface) {
-        this.leaderboardRepository = leaderboardRepository
-    }
+    constructor(leaderboardRepository: LeaderboardRepositoryInterface) {}
 
     getTop100 = async (response: Response) => {
killedBy: LeaderboardController getTop100 returns top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/leaderboardController.ts:13:47
         this.leaderboardRepository = leaderboardRepository
     }
 
-    getTop100 = async (response: Response) => {
-        try {
-            const top100 = await this.leaderboardRepository.getTop100()
-            return ResponseSender.result(response, 200, top100)
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getTop100 = async (response: Response) => {}
 }
 
killedBy: LeaderboardController getTop100 returns top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/leaderboardController.ts:14:13
     }
 
     getTop100 = async (response: Response) => {
-        try {
-            const top100 = await this.leaderboardRepository.getTop100()
-            return ResponseSender.result(response, 200, top100)
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: LeaderboardController getTop100 returns top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/controller/leaderboardController.ts:17:30
         try {
             const top100 = await this.leaderboardRepository.getTop100()
             return ResponseSender.result(response, 200, top100)
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 }
killedBy: LeaderboardController getTop100 sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0
