[Killed] BlockStatement
src/controller/userController.ts:14:58
 export class UserController {
     private userRepository: UserRepositoryInterface
 
-    constructor(userRepository: UserRepositoryInterface) {
-        this.userRepository = userRepository
-    }
+    constructor(userRepository: UserRepositoryInterface) {}
 
     userNotFoundError = (response: Response) => ResponseSender.error(
killedBy: UserController getAllUsers returns all users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}, 200, "users"

Number of calls: 0

[Killed] ArrowFunction
src/controller/userController.ts:18:25
         this.userRepository = userRepository
     }
 
-    userNotFoundError = (response: Response) => ResponseSender.error(
-        response,
-        NotFoundError.getErrorDocument('The user'),
-    )
+    userNotFoundError = () => undefined
 
     getAllUsers = async (response: Response) => {
killedBy: UserController userNotFoundError sends an NotfoundError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:23:49
         NotFoundError.getErrorDocument('The user'),
     )
 
-    getAllUsers = async (response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.userRepository.getAllUsers(),
-            )
-        } catch (error: any) {
-            return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getAllUsers = async (response: Response) => {}
 
     getUserById = async ({ id }: { id: number | string }, response: Response) => {
killedBy: UserController getAllUsers returns all users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}, 200, "users"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:24:13
     )
 
     getAllUsers = async (response: Response) => {
-        try {
-            return ResponseSender.result(
-                response,
-                200,
-                await this.userRepository.getAllUsers(),
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
         }
killedBy: UserController getAllUsers returns all users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}, 200, "users"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:35:82
         }
     }
 
-    getUserById = async ({ id }: { id: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserById(id))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getUserById = async ({ id }: { id: number | string }, response: Response) => {}
 
     getUserByUid = async ({ uid }: { uid: number | string }, response: Response) => {
killedBy: UserController getUserById returns a user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 12

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:36:13
     }
 
     getUserById = async ({ id }: { id: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserById(id))
-        } catch (error: any) {
+        try {} catch (error: any) {
             return error instanceof NotFoundError
                 ? this.userNotFoundError(response)
killedBy: UserController getUserById returns a user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 12

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:38:30
     getUserById = async ({ id }: { id: number | string }, response: Response) => {
         try {
             return ResponseSender.result(response, 200, await this.userRepository.getUserById(id))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: UserController getUserById sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:45:85
         }
     }
 
-    getUserByUid = async ({ uid }: { uid: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserByUid(uid))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getUserByUid = async ({ uid }: { uid: number | string }, response: Response) => {}
 
     getUserByFriendsCode = async ({ fc }: { fc: number | string }, response: Response) => {
killedBy: UserController getUserByUid returns a user by uid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 12

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:46:13
     }
 
     getUserByUid = async ({ uid }: { uid: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserByUid(uid))
-        } catch (error: any) {
+        try {} catch (error: any) {
             return error instanceof NotFoundError
                 ? this.userNotFoundError(response)
killedBy: UserController getUserByUid returns a user by uid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 12

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:48:30
     getUserByUid = async ({ uid }: { uid: number | string }, response: Response) => {
         try {
             return ResponseSender.result(response, 200, await this.userRepository.getUserByUid(uid))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: UserController getUserByUid sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:55:91
         }
     }
 
-    getUserByFriendsCode = async ({ fc }: { fc: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserByFriendsCode(fc))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    getUserByFriendsCode = async ({ fc }: { fc: number | string }, response: Response) => {}
 
     createUser = async (
killedBy: UserController getUserByFriendsCode returns a user by friends code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abcdef"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:56:13
     }
 
     getUserByFriendsCode = async ({ fc }: { fc: number | string }, response: Response) => {
-        try {
-            return ResponseSender.result(response, 200, await this.userRepository.getUserByFriendsCode(fc))
-        } catch (error: any) {
+        try {} catch (error: any) {
             return error instanceof NotFoundError
                 ? this.userNotFoundError(response)
killedBy: UserController getUserByFriendsCode returns a user by friends code
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abcdef"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:58:30
     getUserByFriendsCode = async ({ fc }: { fc: number | string }, response: Response) => {
         try {
             return ResponseSender.result(response, 200, await this.userRepository.getUserByFriendsCode(fc))
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 
killedBy: UserController getUserByFriendsCode sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:69:13
         { email, username, uid }: { email: string, username: string, uid: string },
         response: Response,
     ) => {
-        try {
-            await this.userRepository.checkUsernameAndMail(username, email)
-            return ResponseSender.result(
-                response,
-                201,
-                await this.userRepository.createUser({ email, uid, username }),
-            )
-        } catch (error: any) {
+        try {} catch (error: any) {
             switch (error.constructor) {
             case ValueAlreadyExistsError: {
killedBy: UserController createUser creates an user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "name", "mail"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:76:30
                 201,
                 await this.userRepository.createUser({ email, uid, username }),
             )
-        } catch (error: any) {
-            switch (error.constructor) {
-            case ValueAlreadyExistsError: {
-                return ResponseSender.error(
-                    response,
-                    ValueAlreadyExistsError.getErrorDocument(error.message),
-                )
-            }
-            case ForbiddenError: {
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument())
-            }
-            case NegativeNumbersNotAllowedError: {
-                return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
-            }
-            case MaximumFriendsCodeLimitExceededError: {
-                return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
-            }
-            default: {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
-            }
-        }
+        } catch (error: any) {}
     }
 
killedBy: UserController createUser sends an error if new user attributes already exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ConditionalExpression
src/controller/userController.ts:78:13
             )
         } catch (error: any) {
             switch (error.constructor) {
-            case ValueAlreadyExistsError: {
-                return ResponseSender.error(
-                    response,
-                    ValueAlreadyExistsError.getErrorDocument(error.message),
-                )
-            }
+            case ValueAlreadyExistsError:
             case ForbiddenError: {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument())
killedBy: UserController createUser sends an error if new user attributes already exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "msg already taken.",

[Killed] BlockStatement
src/controller/userController.ts:78:43
             )
         } catch (error: any) {
             switch (error.constructor) {
-            case ValueAlreadyExistsError: {
-                return ResponseSender.error(
-                    response,
-                    ValueAlreadyExistsError.getErrorDocument(error.message),
-                )
-            }
+            case ValueAlreadyExistsError: {}
             case ForbiddenError: {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument())
killedBy: UserController createUser sends an error if new user attributes already exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "msg already taken.",

[Killed] ConditionalExpression
src/controller/userController.ts:84:13
                     ValueAlreadyExistsError.getErrorDocument(error.message),
                 )
             }
-            case ForbiddenError: {
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument())
-            }
+            case ForbiddenError:
             case NegativeNumbersNotAllowedError: {
                 return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
killedBy: UserController createUser sends an error if access is forbidden
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "undefined",

[Killed] BlockStatement
src/controller/userController.ts:84:34
                     ValueAlreadyExistsError.getErrorDocument(error.message),
                 )
             }
-            case ForbiddenError: {
-                return ResponseSender.error(response, ForbiddenError.getErrorDocument())
-            }
+            case ForbiddenError: {}
             case NegativeNumbersNotAllowedError: {
                 return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
killedBy: UserController createUser sends an error if access is forbidden
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "undefined",

[Killed] BlockStatement
src/controller/userController.ts:87:50
             case ForbiddenError: {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument())
             }
-            case NegativeNumbersNotAllowedError: {
-                return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
-            }
+            case NegativeNumbersNotAllowedError: {}
             case MaximumFriendsCodeLimitExceededError: {
                 return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
killedBy: UserController createUser sends an error if id for friends code generation is negative (as per db design this shouldn't happen)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "Negative numbers not allowed.",

[Killed] ConditionalExpression
src/controller/userController.ts:87:13
             case ForbiddenError: {
                 return ResponseSender.error(response, ForbiddenError.getErrorDocument())
             }
-            case NegativeNumbersNotAllowedError: {
-                return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
-            }
+            case NegativeNumbersNotAllowedError:
             case MaximumFriendsCodeLimitExceededError: {
                 return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
killedBy: UserController createUser sends an error if id for friends code generation is negative (as per db design this shouldn't happen)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "Negative numbers not allowed.",

[Killed] ConditionalExpression
src/controller/userController.ts:90:13
             case NegativeNumbersNotAllowedError: {
                 return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
             }
-            case MaximumFriendsCodeLimitExceededError: {
-                return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
-            }
+            case MaximumFriendsCodeLimitExceededError:
             default: {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
killedBy: UserController createUser sends an error if maximum number of friends codes is reached
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "There are no more friends codes available.",

[Killed] BlockStatement
src/controller/userController.ts:90:56
             case NegativeNumbersNotAllowedError: {
                 return ResponseSender.error(response, NegativeNumbersNotAllowedError.getErrorDocument())
             }
-            case MaximumFriendsCodeLimitExceededError: {
-                return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
-            }
+            case MaximumFriendsCodeLimitExceededError: {}
             default: {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
killedBy: UserController createUser sends an error if maximum number of friends codes is reached
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]},
  Object {
-   "detail": "There are no more friends codes available.",

[Killed] ConditionalExpression
src/controller/userController.ts:93:13
             case MaximumFriendsCodeLimitExceededError: {
                 return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
             }
-            default: {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
+            default:
             }
         }
killedBy: UserController createUser sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:93:22
             case MaximumFriendsCodeLimitExceededError: {
                 return ResponseSender.error(response, MaximumFriendsCodeLimitExceededError.getErrorDocument())
             }
-            default: {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
+            default: {}
             }
         }
killedBy: UserController createUser sends an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:103:10
     updateUser = async (
         { email, username, uid }: { email: string, username: string, uid: string },
         response: Response,
-    ) => {
-        // TODO: what if just one attribute has changed?
-        // right now this would probably throw an error "Email or Username already taken"
-        // this has to be done before FQ-275
-        try {
-            await this.userRepository.checkUsernameAndMail(username, email)
-            const { user, points } = await this.userRepository.updateUser(uid, { username, email })
-            return ResponseSender.result(response, 200, user, { amount: points, total: user.points })
-        } catch (error: any) {
-            switch (error.constructor) {
-            case ValueAlreadyExistsError: {
-                return ResponseSender.error(
-                    response,
-                    ValueAlreadyExistsError.getErrorDocument(error.message),
-                )
-            }
-            case NotFoundError: {
-                return this.userNotFoundError(response)
-            }
-            default: {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
-            }
-        }
-    }
+    ) => {}
 
     deleteUser = async ({ uid }: { uid: string }, response: Response) => {
killedBy: UserController updateUser updates user data (username, mail)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "name", "mail"

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:107:13
         // TODO: what if just one attribute has changed?
         // right now this would probably throw an error "Email or Username already taken"
         // this has to be done before FQ-275
-        try {
-            await this.userRepository.checkUsernameAndMail(username, email)
-            const { user, points } = await this.userRepository.updateUser(uid, { username, email })
-            return ResponseSender.result(response, 200, user, { amount: points, total: user.points })
-        } catch (error: any) {
+        try {} catch (error: any) {
             switch (error.constructor) {
             case ValueAlreadyExistsError: {
killedBy: UserController updateUser updates user data (username, mail)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "name", "mail"

Number of calls: 0

[Killed] ObjectLiteral
src/controller/userController.ts:109:80
         // this has to be done before FQ-275
         try {
             await this.userRepository.checkUsernameAndMail(username, email)
-            const { user, points } = await this.userRepository.updateUser(uid, { username, email })
+            const { user, points } = await this.userRepository.updateUser(uid, {})
             return ResponseSender.result(response, 200, user, { amount: points, total: user.points })
         } catch (error: any) {
killedBy: UserController updateUser updates user data (username, mail)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "uid",
- Object {
-   "email": "mail",

[Killed] BlockStatement
src/controller/userController.ts:111:30
             await this.userRepository.checkUsernameAndMail(username, email)
             const { user, points } = await this.userRepository.updateUser(uid, { username, email })
             return ResponseSender.result(response, 200, user, { amount: points, total: user.points })
-        } catch (error: any) {
-            switch (error.constructor) {
-            case ValueAlreadyExistsError: {
-                return ResponseSender.error(
-                    response,
-                    ValueAlreadyExistsError.getErrorDocument(error.message),
-                )
-            }
-            case NotFoundError: {
-                return this.userNotFoundError(response)
-            }
-            default: {
-                return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-            }
-            }
-        }
+        } catch (error: any) {}
     }
 
killedBy: UserController updateUser sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:119:33
                     ValueAlreadyExistsError.getErrorDocument(error.message),
                 )
             }
-            case NotFoundError: {
-                return this.userNotFoundError(response)
-            }
+            case NotFoundError: {}
             default: {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
killedBy: UserController updateUser sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ConditionalExpression
src/controller/userController.ts:119:13
                     ValueAlreadyExistsError.getErrorDocument(error.message),
                 )
             }
-            case NotFoundError: {
-                return this.userNotFoundError(response)
-            }
+            case NotFoundError:
             default: {
                 return ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
killedBy: UserController updateUser sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:129:74
         }
     }
 
-    deleteUser = async ({ uid }: { uid: string }, response: Response) => {
-        try {
-            await this.userRepository.deleteUser(uid)
-            return response.sendStatus(204)
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
-    }
+    deleteUser = async ({ uid }: { uid: string }, response: Response) => {}
 }
 
killedBy: UserController deleteUser deletes an user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 204

Number of calls: 0

[Killed] BlockStatement
src/controller/userController.ts:130:13
     }
 
     deleteUser = async ({ uid }: { uid: string }, response: Response) => {
-        try {
-            await this.userRepository.deleteUser(uid)
-            return response.sendStatus(204)
-        } catch (error: any) {
+        try {} catch (error: any) {
             return error instanceof NotFoundError
                 ? this.userNotFoundError(response)
killedBy: UserController deleteUser deletes an user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 204

Number of calls: 0
