[Killed] BlockStatement
src/controller/userController.ts:133:30
         try {
             await this.userRepository.deleteUser(uid)
             return response.sendStatus(204)
-        } catch (error: any) {
-            return error instanceof NotFoundError
-                ? this.userNotFoundError(response)
-                : ResponseSender.error(response, InternalServerError.getErrorDocument(error.message))
-        }
+        } catch (error: any) {}
     }
 }
killedBy: UserController deleteUser sends an error if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0
