[Killed] BlockStatement
src/errors/ProblemDocument.ts:6:50
 
 /* eslint-disable-next-line unicorn/no-static-only-class */
 export class Mapper {
-    static mapError(error: any): ProblemDocument {
-        return {
-            title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
-            status: error.status || 500,
-            ...error,
-        }
-    }
+    static mapError(error: any): ProblemDocument {}
 }
 
killedBy: LeaderboardController getTop100 sends an error if something goes wrong
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
src/errors/ProblemDocument.ts:7:16
 /* eslint-disable-next-line unicorn/no-static-only-class */
 export class Mapper {
     static mapError(error: any): ProblemDocument {
-        return {
-            title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
-            status: error.status || 500,
-            ...error,
-        }
+        return {}
     }
 }
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: undefined

Number of calls: 1

[Killed] ConditionalExpression
src/errors/ProblemDocument.ts:8:20
 export class Mapper {
     static mapError(error: any): ProblemDocument {
         return {
-            title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
+            title: true,
             status: error.status || 500,
             ...error,
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "detail": "error",
    "status": 403,

[Killed] ConditionalExpression
src/errors/ProblemDocument.ts:8:20
 export class Mapper {
     static mapError(error: any): ProblemDocument {
         return {
-            title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
+            title: false,
             status: error.status || 500,
             ...error,
killedBy: FirebaseAuth throws an error if something goes wrong
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "detail": "error",
    "status": 403,

[Survived] LogicalOperator
src/errors/ProblemDocument.ts:9:21
     static mapError(error: any): ProblemDocument {
         return {
             title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
-            status: error.status || 500,
+            status: error.status && 500,
             ...error,
         }

[Survived] ConditionalExpression
src/errors/ProblemDocument.ts:9:21
     static mapError(error: any): ProblemDocument {
         return {
             title: getReasonPhrase(error.status) || ReasonPhrases.INTERNAL_SERVER_ERROR,
-            status: error.status || 500,
+            status: false,
             ...error,
         }
