[Survived] BlockStatement
src/helper/deepFreeze.ts:1:63
-export const deepFreeze = (object: { [key: string]: any }) => {
-    Object.keys(object).forEach((property) => {
-        if (typeof object[String(property)] === 'object' && !Object.isFrozen(object[String(property)])) {
-            deepFreeze(object[String(property)])
-        }
-    })
-    return Object.freeze(object)
-}
+export const deepFreeze = (object: { [key: string]: any }) => {}
 

[Killed] BlockStatement
src/helper/deepFreeze.ts:2:47
 export const deepFreeze = (object: { [key: string]: any }) => {
-    Object.keys(object).forEach((property) => {
-        if (typeof object[String(property)] === 'object' && !Object.isFrozen(object[String(property)])) {
-            deepFreeze(object[String(property)])
-        }
-    })
+    Object.keys(object).forEach((property) => {})
     return Object.freeze(object)
 }
killedBy: deepFreeze should freeze an object with object as value
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] EqualityOperator
src/helper/deepFreeze.ts:3:13
 export const deepFreeze = (object: { [key: string]: any }) => {
     Object.keys(object).forEach((property) => {
-        if (typeof object[String(property)] === 'object' && !Object.isFrozen(object[String(property)])) {
+        if (typeof object[String(property)] !== 'object' && !Object.isFrozen(object[String(property)])) {
             deepFreeze(object[String(property)])
         }
killedBy: deepFreeze should freeze an object with object as value
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] BooleanLiteral
src/helper/deepFreeze.ts:3:61
 export const deepFreeze = (object: { [key: string]: any }) => {
     Object.keys(object).forEach((property) => {
-        if (typeof object[String(property)] === 'object' && !Object.isFrozen(object[String(property)])) {
+        if (typeof object[String(property)] === 'object' && Object.isFrozen(object[String(property)])) {
             deepFreeze(object[String(property)])
         }
killedBy: deepFreeze should freeze an object with object as value
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw
