[Killed] BlockStatement
src/helper/responseSender.ts:11:10
         code: number,
         data: any,
         { amount, total }: Partial<Points> = {},
-    ) => {
-        let points = {}
-        if (amount || total) {
-            points = {
-                amount: amount || 0,
-                total: total || 0,
-            }
-        }
-        return response.status(code).json({
-            data,
-            points,
-        })
-    }
+    ) => {}
 
     public static error = (response: Response, error: ProblemDocument) => {
killedBy: ResponseSender result has a static method to send a result
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/helper/responseSender.ts:13:13
         { amount, total }: Partial<Points> = {},
     ) => {
         let points = {}
-        if (amount || total) {
+        if (true) {
             points = {
                 amount: amount || 0,
killedBy: ResponseSender result returns given data as json (without points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "foo": "bar",

[Killed] BlockStatement
src/helper/responseSender.ts:13:30
         { amount, total }: Partial<Points> = {},
     ) => {
         let points = {}
-        if (amount || total) {
-            points = {
-                amount: amount || 0,
-                total: total || 0,
-            }
-        }
+        if (amount || total) {}
         return response.status(code).json({
             data,
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "foo": "bar",

[Killed] ObjectLiteral
src/helper/responseSender.ts:14:22
     ) => {
         let points = {}
         if (amount || total) {
-            points = {
-                amount: amount || 0,
-                total: total || 0,
-            }
+            points = {}
         }
         return response.status(code).json({
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "foo": "bar",

[Killed] LogicalOperator
src/helper/responseSender.ts:15:25
         let points = {}
         if (amount || total) {
             points = {
-                amount: amount || 0,
+                amount: amount && 0,
                 total: total || 0,
             }
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "foo": "bar",

[Killed] ConditionalExpression
src/helper/responseSender.ts:15:25
         let points = {}
         if (amount || total) {
             points = {
-                amount: amount || 0,
+                amount: false,
                 total: total || 0,
             }
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "foo": "bar",

[Killed] ConditionalExpression
src/helper/responseSender.ts:16:24
         if (amount || total) {
             points = {
                 amount: amount || 0,
-                total: total || 0,
+                total: true,
             }
         }
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "data": Object {
      "foo": "bar",

[Killed] ConditionalExpression
src/helper/responseSender.ts:16:24
         if (amount || total) {
             points = {
                 amount: amount || 0,
-                total: total || 0,
+                total: false,
             }
         }
killedBy: ResponseSender result returns given data as json (with points)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "data": Object {
      "foo": "bar",

[Killed] BlockStatement
src/helper/responseSender.ts:25:75
         })
     }
 
-    public static error = (response: Response, error: ProblemDocument) => {
-        response.setHeader('Content-Type', 'application/problem+json')
-        return response.status(error.status).json(error)
-    }
+    public static error = (response: Response, error: ProblemDocument) => {}
 }
 
killedBy: ResponseSender error has a static method to send an error
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] StringLiteral
src/helper/responseSender.ts:26:28
     }
 
     public static error = (response: Response, error: ProblemDocument) => {
-        response.setHeader('Content-Type', 'application/problem+json')
+        response.setHeader("", 'application/problem+json')
         return response.status(error.status).json(error)
     }
