[Killed] BlockStatement
src/helper/startApplication.ts:7:74
 import { ORM } from '../orm.js'
 import Application from '../application.js'
 
-export const startApplication = async (): Promise<Server | undefined> => {
-    config()
-
-    try {
-        const orm = await ORM.init()
-        const server = express()
-        const application = new Application(orm, server)
-        return application.init()
-    } catch (error: any) {
-        console.error(error)
-        return undefined
-    }
-}
+export const startApplication = async (): Promise<Server | undefined> => {}
 
killedBy: startApplication should start application with correct setup
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/helper/startApplication.ts:10:9
 export const startApplication = async (): Promise<Server | undefined> => {
     config()
 
-    try {
-        const orm = await ORM.init()
-        const server = express()
-        const application = new Application(orm, server)
-        return application.init()
-    } catch (error: any) {
+    try {} catch (error: any) {
         console.error(error)
         return undefined
killedBy: startApplication should start application with correct setup
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/helper/startApplication.ts:15:26
         const server = express()
         const application = new Application(orm, server)
         return application.init()
-    } catch (error: any) {
-        console.error(error)
-        return undefined
-    }
+    } catch (error: any) {}
 }
 
killedBy: startApplication should console error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: test]

Number of calls: 0
