[Killed] BlockStatement
src/middlewares/errorHandler.ts:5:88
 import { validationResult } from 'express-validator'
 import ResponseSender from '../helper/responseSender.js'
 
-export function errorHandler(request: Request, response: Response, next: NextFunction) {
-    const errors = validationResult(request)
-    if (!errors.isEmpty()) {
-        const error = errors.array()[0]
-        const errorType = error.msg.type
-        return ResponseSender.error(response, errorType.getErrorDocument(error.msg.message))
-    }
-    return next()
-}
+export function errorHandler(request: Request, response: Response, next: NextFunction) {}
 
killedBy: ErrorHandler returns next function if no validation errors detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "next"
Received: undefined

[Killed] BooleanLiteral
src/middlewares/errorHandler.ts:7:9
 
 export function errorHandler(request: Request, response: Response, next: NextFunction) {
     const errors = validationResult(request)
-    if (!errors.isEmpty()) {
+    if (errors.isEmpty()) {
         const error = errors.array()[0]
         const errorType = error.msg.type
killedBy: ErrorHandler returns next function if no validation errors detected
statusReason: TypeError: errors.array is not a function

[Killed] BlockStatement
src/middlewares/errorHandler.ts:7:28
 
 export function errorHandler(request: Request, response: Response, next: NextFunction) {
     const errors = validationResult(request)
-    if (!errors.isEmpty()) {
-        const error = errors.array()[0]
-        const errorType = error.msg.type
-        return ResponseSender.error(response, errorType.getErrorDocument(error.msg.message))
-    }
+    if (!errors.isEmpty()) {}
     return next()
 }
killedBy: ErrorHandler returns error because validation detected errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}, "getErrorDocument"

Number of calls: 0
