[Killed] BlockStatement
src/orm.ts:8:58
 export class ORM {
     orm: MikroORM<PostgreSqlDriver>
 
-    private constructor(orm: MikroORM<PostgreSqlDriver>) {
-        this.orm = orm
-    }
+    private constructor(orm: MikroORM<PostgreSqlDriver>) {}
 
     static async init() {
killedBy: ORM returns a fork of the entity manager
statusReason: TypeError: Cannot read properties of undefined (reading 'em')

[Killed] BlockStatement
src/orm.ts:12:25
         this.orm = orm
     }
 
-    static async init() {
-        return new ORM(await MikroORM.init<PostgreSqlDriver>(mikroOrmConfig))
-    }
+    static async init() {}
 
     forkEm(): EntityManager {
killedBy: ORM has a static method to initialize and return the orm
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/orm.ts:16:29
         return new ORM(await MikroORM.init<PostgreSqlDriver>(mikroOrmConfig))
     }
 
-    forkEm(): EntityManager {
-        return this.orm.em.fork()
-    }
+    forkEm(): EntityManager {}
 }
 
killedBy: ORM returns a fork of the entity manager
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: undefined
