[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:16:68
 
     private readonly userRepository: UserRepositoryInterface
 
-    constructor(userRepository: UserRepositoryInterface, orm: ORM) {
-        this.userRepository = userRepository
-        this.orm = orm
-    }
+    constructor(userRepository: UserRepositoryInterface, orm: ORM) {}
 
     getFriendshipsWithSpecifiedOptions = async (
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: TypeError: Cannot read properties of undefined (reading 'getUserById')

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:25:33
         user: User,
         filters: {} = {},
         options: {} = {},
-    ): Promise<Friendship[]> => {
-        const em = this.orm.forkEm()
-        return em.find(
-            'Friendship',
-            {
-                $or: [{ invitor: user }, { invitee: user }],
-                ...filters,
-            } as any,
-            options,
-        )
-    }
+    ): Promise<Friendship[]> => {}
 
     getFriendshipsByUid = async (userId: number | string) => {
killedBy: FriendshipPostgresRepository returns a friendship with specified options
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:37:62
         )
     }
 
-    getFriendshipsByUid = async (userId: number | string) => {
-        const user = await this.userRepository.getUserById(userId)
-        const friendships = await this.getFriendshipsWithSpecifiedOptions(
-            user,
-            {},
-            { populate: [ 'invitor', 'invitee' ] },
-        )
-        return friendships.map(
-            (friendship: Friendship) => ({
-                ...friendship,
-                invitor: friendship.invitor.id,
-                invitee: friendship.invitee.id,
-                friend: friendship.invitor.id === user.id ? friendship.invitee : friendship.invitor,
-            }),
-        )
-    }
+    getFriendshipsByUid = async (userId: number | string) => {}
 
     getFriendshipById = async (id: number | string): Promise<Friendship> => {
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ObjectLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:42:13
         const friendships = await this.getFriendshipsWithSpecifiedOptions(
             user,
             {},
-            { populate: [ 'invitor', 'invitee' ] },
+            {},
         )
         return friendships.map(
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": 1},
  {},
- Object {

[Killed] StringLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:42:27
         const friendships = await this.getFriendshipsWithSpecifiedOptions(
             user,
             {},
-            { populate: [ 'invitor', 'invitee' ] },
+            { populate: [ "", 'invitee' ] },
         )
         return friendships.map(
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": 1},
  {},
  Object {

[Killed] ArrowFunction
src/repositories/friendship/friendshipPostgresRepository.ts:45:13
             { populate: [ 'invitor', 'invitee' ] },
         )
         return friendships.map(
-            (friendship: Friendship) => ({
-                ...friendship,
-                invitor: friendship.invitor.id,
-                invitee: friendship.invitee.id,
-                friend: friendship.invitor.id === user.id ? friendship.invitee : friendship.invitor,
-            }),
+            () => undefined,
         )
     }
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  2

  Array [
-   Object {
-     "friend": Object {

[Killed] EqualityOperator
src/repositories/friendship/friendshipPostgresRepository.ts:49:25
                 ...friendship,
                 invitor: friendship.invitor.id,
                 invitee: friendship.invitee.id,
-                friend: friendship.invitor.id === user.id ? friendship.invitee : friendship.invitor,
+                friend: friendship.invitor.id !== user.id ? friendship.invitee : friendship.invitor,
             }),
         )
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
      "friend": Object {

[Killed] ConditionalExpression
src/repositories/friendship/friendshipPostgresRepository.ts:49:25
                 ...friendship,
                 invitor: friendship.invitor.id,
                 invitee: friendship.invitee.id,
-                friend: friendship.invitor.id === user.id ? friendship.invitee : friendship.invitor,
+                friend: false ? friendship.invitee : friendship.invitor,
             }),
         )
killedBy: FriendshipPostgresRepository returns all friendships of given user id
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
      "invitee": 1,
      "invitor": 4,

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:54:77
         )
     }
 
-    getFriendshipById = async (id: number | string): Promise<Friendship> => {
-        const em = this.orm.forkEm()
-        return em.findOneOrFail(
-            'Friendship',
-            { id } as any,
-            {
-                populate: [ 'invitor', 'invitee' ],
-                failHandler: () => { throw new NotFoundError('The friendship') },
-            },
-        )
-    }
+    getFriendshipById = async (id: number | string): Promise<Friendship> => {}
 
     checkForExistingFriendship = async (invitor: User, invitee: User) => {
killedBy: FriendshipPostgresRepository getFriendshipsById returns one friendship by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:59:13
         return em.findOneOrFail(
             'Friendship',
             { id } as any,
-            {
-                populate: [ 'invitor', 'invitee' ],
-                failHandler: () => { throw new NotFoundError('The friendship') },
-            },
+            {},
         )
     }
killedBy: FriendshipPostgresRepository getFriendshipsById returns one friendship by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Friendship",
  {"id": 1},
- Object {

[Killed] StringLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:60:40
             'Friendship',
             { id } as any,
             {
-                populate: [ 'invitor', 'invitee' ],
+                populate: [ 'invitor', "" ],
                 failHandler: () => { throw new NotFoundError('The friendship') },
             },
killedBy: FriendshipPostgresRepository getFriendshipsById returns one friendship by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "Friendship",
  {"id": 1},
  Object {

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:61:36
             { id } as any,
             {
                 populate: [ 'invitor', 'invitee' ],
-                failHandler: () => { throw new NotFoundError('The friendship') },
+                failHandler: () => {},
             },
         )
killedBy: FriendshipPostgresRepository getFriendshipsById throws an error if friendship does not exist
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:61:62
             { id } as any,
             {
                 populate: [ 'invitor', 'invitee' ],
-                failHandler: () => { throw new NotFoundError('The friendship') },
+                failHandler: () => { throw new NotFoundError("") },
             },
         )

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:66:74
         )
     }
 
-    checkForExistingFriendship = async (invitor: User, invitee: User) => {
-        const em = this.orm.forkEm()
-        const [ invitorFriendship, inviteeFriendship ] = await Promise.all([
-            em.find('Friendship', { invitor, invitee } as any),
-            em.find('Friendship', { invitee: invitor, invitor: invitee } as any),
-        ])
-        if (invitorFriendship.length > 0 || inviteeFriendship.length > 0) {
-            throw new FriendshipAlreadyExistsError()
-        }
-    }
+    checkForExistingFriendship = async (invitor: User, invitee: User) => {}
 
     createFriendship = async (invitor: User, invitee: User) => {
killedBy: FriendshipPostgresRepository checkForExistingFriendship throws an error if friendship already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArrayDeclaration
src/repositories/friendship/friendshipPostgresRepository.ts:68:76
 
     checkForExistingFriendship = async (invitor: User, invitee: User) => {
         const em = this.orm.forkEm()
-        const [ invitorFriendship, inviteeFriendship ] = await Promise.all([
-            em.find('Friendship', { invitor, invitee } as any),
-            em.find('Friendship', { invitee: invitor, invitor: invitee } as any),
-        ])
+        const [ invitorFriendship, inviteeFriendship ] = await Promise.all([])
         if (invitorFriendship.length > 0 || inviteeFriendship.length > 0) {
             throw new FriendshipAlreadyExistsError()
killedBy: FriendshipPostgresRepository checkForExistingFriendship throws an error if friendship already exists
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: FriendshipAlreadyExistsError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'length')"

      134 |         invitor: invitee

[Killed] StringLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:70:21
         const em = this.orm.forkEm()
         const [ invitorFriendship, inviteeFriendship ] = await Promise.all([
             em.find('Friendship', { invitor, invitee } as any),
-            em.find('Friendship', { invitee: invitor, invitor: invitee } as any),
+            em.find("", { invitee: invitor, invitor: invitee } as any),
         ])
         if (invitorFriendship.length > 0 || inviteeFriendship.length > 0) {
killedBy: FriendshipPostgresRepository checkForExistingFriendship throws an error if friendship already exists
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: "Friendship", {"invitee": {"id": 1}, "invitor": {"id": 2}}
Received
       1: "Friendship", {"invitee": {"id": 2}, "invitor": {"id": 1}}
->     2
          "",

[Killed] ConditionalExpression
src/repositories/friendship/friendshipPostgresRepository.ts:72:13
             em.find('Friendship', { invitor, invitee } as any),
             em.find('Friendship', { invitee: invitor, invitor: invitee } as any),
         ])
-        if (invitorFriendship.length > 0 || inviteeFriendship.length > 0) {
+        if (false) {
             throw new FriendshipAlreadyExistsError()
         }
killedBy: FriendshipPostgresRepository checkForExistingFriendship throws an error if friendship already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/repositories/friendship/friendshipPostgresRepository.ts:72:13
             em.find('Friendship', { invitor, invitee } as any),
             em.find('Friendship', { invitee: invitor, invitor: invitee } as any),
         ])
-        if (invitorFriendship.length > 0 || inviteeFriendship.length > 0) {
+        if (false || inviteeFriendship.length > 0) {
             throw new FriendshipAlreadyExistsError()
         }
killedBy: FriendshipPostgresRepository checkForExistingFriendship throws an error if friendship already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:77:64
         }
     }
 
-    createFriendship = async (invitor: User, invitee: User) => {
-        const em = this.orm.forkEm()
-        const friendship = new Friendship(invitor, invitee)
-        await em.persistAndFlush(friendship)
-        return friendship
-    }
+    createFriendship = async (invitor: User, invitee: User) => {}
 
     acceptFriendship = async (friendship: Friendship) => {
killedBy: FriendshipPostgresRepository creates and returns a new friendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:84:58
         return friendship
     }
 
-    acceptFriendship = async (friendship: Friendship) => {
-        const em = this.orm.forkEm()
-        const friendshipWithStatus = em.assign(friendship, {
-            status: FriendshipStatus.ACCEPTED,
-        })
-        /* eslint-disable-next-line no-unused-vars */
-        await em.persistAndFlush(friendshipWithStatus)
-        const [ invitor, invitee ] = await Promise.all([
-            this.userRepository.addPoints(friendship.invitor.uid, Points.NEW_FRIENDSHIP),
-            this.userRepository.addPoints(friendship.invitee.uid, Points.NEW_FRIENDSHIP),
-        ])
-        return { invitor, invitee, points: Points.NEW_FRIENDSHIP }
-    }
+    acceptFriendship = async (friendship: Friendship) => {}
 
     declineOrDeleteExistingFriendship = async (friendship: Friendship) => {
killedBy: FriendshipPostgresRepository accepts a friendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/repositories/friendship/friendshipPostgresRepository.ts:95:16
             this.userRepository.addPoints(friendship.invitor.uid, Points.NEW_FRIENDSHIP),
             this.userRepository.addPoints(friendship.invitee.uid, Points.NEW_FRIENDSHIP),
         ])
-        return { invitor, invitee, points: Points.NEW_FRIENDSHIP }
+        return {}
     }
 
killedBy: FriendshipPostgresRepository accepts a friendship
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "invitee": "user2",
-   "invitor": "user1",

[Killed] BlockStatement
src/repositories/friendship/friendshipPostgresRepository.ts:98:75
         return { invitor, invitee, points: Points.NEW_FRIENDSHIP }
     }
 
-    declineOrDeleteExistingFriendship = async (friendship: Friendship) => {
-        const em = this.orm.forkEm()
-        return em.removeAndFlush(friendship)
-    }
+    declineOrDeleteExistingFriendship = async (friendship: Friendship) => {}
 }
 
killedBy: FriendshipPostgresRepository declines or deletes a friendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
