[Killed] BlockStatement
src/repositories/leaderboard/leaderboardPostgresRepository.ts:7:27
 export class LeaderboardPostgresRepository implements LeaderboardRepositoryInterface {
     private readonly orm: ORM
 
-    constructor(orm: ORM) {
-        this.orm = orm
-    }
+    constructor(orm: ORM) {}
 
     getTop100 = async () => {
killedBy: LeaderboardPostgresRepository return top 100 users
statusReason: TypeError: Cannot read properties of undefined (reading 'forkEm')

[Killed] BlockStatement
src/repositories/leaderboard/leaderboardPostgresRepository.ts:11:29
         this.orm = orm
     }
 
-    getTop100 = async () => {
-        const em = this.orm.forkEm()
-        return em.find('User', {}, { limit: 100, orderBy: [{ points: 'desc' }] })
-    }
+    getTop100 = async () => {}
 }
 
killedBy: LeaderboardPostgresRepository return top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/repositories/leaderboard/leaderboardPostgresRepository.ts:13:70
 
     getTop100 = async () => {
         const em = this.orm.forkEm()
-        return em.find('User', {}, { limit: 100, orderBy: [{ points: 'desc' }] })
+        return em.find('User', {}, { limit: 100, orderBy: [{ points: "" }] })
     }
 }
killedBy: LeaderboardPostgresRepository return top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "User",
  {},
  Object {

[Killed] ArrayDeclaration
src/repositories/leaderboard/leaderboardPostgresRepository.ts:13:59
 
     getTop100 = async () => {
         const em = this.orm.forkEm()
-        return em.find('User', {}, { limit: 100, orderBy: [{ points: 'desc' }] })
+        return em.find('User', {}, { limit: 100, orderBy: [] })
     }
 }
killedBy: LeaderboardPostgresRepository return top 100 users
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "User",
  {},
  Object {
