[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:18:87
 
     private readonly orm: ORM
 
-    constructor(userService: UserService, deletionService: DeletionService, orm: ORM) {
-        this.userService = userService
-        this.deletionService = deletionService
-        this.orm = orm
-    }
+    constructor(userService: UserService, deletionService: DeletionService, orm: ORM) {}
 
     checkUsernameAndMail = async (username: string, email: string): Promise<void> => {
killedBy: UserPostgresRepository returns all users
statusReason: TypeError: Cannot read properties of undefined (reading 'forkEm')

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:24:86
         this.orm = orm
     }
 
-    checkUsernameAndMail = async (username: string, email: string): Promise<void> => {
-        const em = this.orm.forkEm()
-        const [ userByUsername, userByMail ] = await Promise.all([
-            em.find('User', { username }),
-            em.find('User', { email }),
-        ])
-        if (userByUsername.length > 0 || userByMail.length > 0) {
-            throw new ValueAlreadyExistsError('Username or email already exists')
-        }
-    }
+    checkUsernameAndMail = async (username: string, email: string): Promise<void> => {}
 
     getUserById = async (id: number | string): Promise<User> => {
killedBy: UserPostgresRepository checkUsernameAndMail throws a ValueAlreadyExistsError if username ([ '' ]) or email ([ '' ]) exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/repositories/user/userPostgresRepository.ts:27:21
     checkUsernameAndMail = async (username: string, email: string): Promise<void> => {
         const em = this.orm.forkEm()
         const [ userByUsername, userByMail ] = await Promise.all([
-            em.find('User', { username }),
+            em.find("", { username }),
             em.find('User', { email }),
         ])
killedBy: UserPostgresRepository checkUsernameAndMail does not throw an error if username and email is not taken
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "User", {"username": "username"}
Received
->     1
          "",
          {"username": "username"},

[Killed] ObjectLiteral
src/repositories/user/userPostgresRepository.ts:27:29
     checkUsernameAndMail = async (username: string, email: string): Promise<void> => {
         const em = this.orm.forkEm()
         const [ userByUsername, userByMail ] = await Promise.all([
-            em.find('User', { username }),
+            em.find('User', {}),
             em.find('User', { email }),
         ])
killedBy: UserPostgresRepository checkUsernameAndMail does not throw an error if username and email is not taken
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: "User", {"username": "username"}
Received
->     1
          "User",
        - Object {

[Killed] EqualityOperator
src/repositories/user/userPostgresRepository.ts:30:42
             em.find('User', { username }),
             em.find('User', { email }),
         ])
-        if (userByUsername.length > 0 || userByMail.length > 0) {
+        if (userByUsername.length > 0 || userByMail.length >= 0) {
             throw new ValueAlreadyExistsError('Username or email already exists')
         }
killedBy: UserPostgresRepository checkUsernameAndMail does not throw an error if username and email is not taken
statusReason: Error: Username or email already exists

[Killed] EqualityOperator
src/repositories/user/userPostgresRepository.ts:30:13
             em.find('User', { username }),
             em.find('User', { email }),
         ])
-        if (userByUsername.length > 0 || userByMail.length > 0) {
+        if (userByUsername.length <= 0 || userByMail.length > 0) {
             throw new ValueAlreadyExistsError('Username or email already exists')
         }
killedBy: UserPostgresRepository checkUsernameAndMail throws a ValueAlreadyExistsError if username ([ '' ]) or email ([]) exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:35:65
         }
     }
 
-    getUserById = async (id: number | string): Promise<User> => {
-        const em = this.orm.forkEm()
-        return em.findOneOrFail(
-            'User',
-            { id } as any,
-            { failHandler: () => { throw new NotFoundError() } },
-        )
-    }
+    getUserById = async (id: number | string): Promise<User> => {}
 
     getUserByUid = async (uid: number | string): Promise<User> => {
killedBy: UserPostgresRepository get user by id returns one user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:40:34
         return em.findOneOrFail(
             'User',
             { id } as any,
-            { failHandler: () => { throw new NotFoundError() } },
+            { failHandler: () => {} },
         )
     }
killedBy: UserPostgresRepository get user by id throws error when user is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
src/repositories/user/userPostgresRepository.ts:40:13
         return em.findOneOrFail(
             'User',
             { id } as any,
-            { failHandler: () => { throw new NotFoundError() } },
+            {},
         )
     }
killedBy: UserPostgresRepository get user by id returns one user by id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "User",
  {"id": 1},
- Object {

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:44:67
         )
     }
 
-    getUserByUid = async (uid: number | string): Promise<User> => {
-        const em = this.orm.forkEm()
-        return em.findOneOrFail(
-            'User',
-            { uid } as any,
-            { failHandler: () => { throw new NotFoundError() } },
-        )
-    }
+    getUserByUid = async (uid: number | string): Promise<User> => {}
 
     getUserByFriendsCode = async (friendsCode: number | string): Promise<User> => {
killedBy: UserPostgresRepository get user by uid returns one user by uid
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:49:34
         return em.findOneOrFail(
             'User',
             { uid } as any,
-            { failHandler: () => { throw new NotFoundError() } },
+            { failHandler: () => {} },
         )
     }
killedBy: UserPostgresRepository get user by uid throws error when user is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:53:83
         )
     }
 
-    getUserByFriendsCode = async (friendsCode: number | string): Promise<User> => {
-        const em = this.orm.forkEm()
-        return em.findOneOrFail(
-            'User',
-            { friendsCode } as any,
-            { failHandler: () => { throw new NotFoundError() } },
-        )
-    }
+    getUserByFriendsCode = async (friendsCode: number | string): Promise<User> => {}
 
     getAllUsers = async () => {
killedBy: UserPostgresRepository get user by friendsCode returns one user by friendsCode
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:58:34
         return em.findOneOrFail(
             'User',
             { friendsCode } as any,
-            { failHandler: () => { throw new NotFoundError() } },
+            { failHandler: () => {} },
         )
     }
killedBy: UserPostgresRepository get user by friendsCode throws error when user is not found
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:62:31
         )
     }
 
-    getAllUsers = async () => {
-        const em = this.orm.forkEm()
-        return em.getRepository('User').findAll()
-    }
+    getAllUsers = async () => {}
 
     createUser = async ({ email, username, uid }: { email: string, username: string, uid: string }) => {
killedBy: UserPostgresRepository returns all users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:67:104
         return em.getRepository('User').findAll()
     }
 
-    createUser = async ({ email, username, uid }: { email: string, username: string, uid: string }) => {
-        const em = this.orm.forkEm()
-        const user = new User(email, uid, username)
-        await em.persistAndFlush(user)
-        const userInDatabase = await this.getUserByUid(uid)
-        const friendsCode = this.userService.numberToBase36String(userInDatabase.id - 1)
-        const userWithFriendsCode = em.assign(user, { friendsCode })
-        await em.persistAndFlush(userWithFriendsCode)
-        return userWithFriendsCode
-    }
+    createUser = async ({ email, username, uid }: { email: string, username: string, uid: string }) => {}
 
     updateUser = async (uid: string, userData: { username: string, email: string }) => {
killedBy: UserPostgresRepository creates and returns a new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArithmeticOperator
src/repositories/user/userPostgresRepository.ts:72:67
         const user = new User(email, uid, username)
         await em.persistAndFlush(user)
         const userInDatabase = await this.getUserByUid(uid)
-        const friendsCode = this.userService.numberToBase36String(userInDatabase.id - 1)
+        const friendsCode = this.userService.numberToBase36String(userInDatabase.id + 1)
         const userWithFriendsCode = em.assign(user, { friendsCode })
         await em.persistAndFlush(userWithFriendsCode)
killedBy: UserPostgresRepository creates and returns a new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 0
Received: 2

Number of calls: 1

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:78:88
         return userWithFriendsCode
     }
 
-    updateUser = async (uid: string, userData: { username: string, email: string }) => {
-        const em = this.orm.forkEm()
-        const userByUid = await this.getUserByUid(uid)
-        const user = em.assign(userByUid, { ...userData, points: userByUid.points + Points.PROFILE_EDITED })
-        await em.persistAndFlush(user)
-        return { user, points: Points.PROFILE_EDITED }
-    }
+    updateUser = async (uid: string, userData: { username: string, email: string }) => {}
 
     deleteUser = async (uid: string) => {
killedBy: UserPostgresRepository updates and returns a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArithmeticOperator
src/repositories/user/userPostgresRepository.ts:81:66
     updateUser = async (uid: string, userData: { username: string, email: string }) => {
         const em = this.orm.forkEm()
         const userByUid = await this.getUserByUid(uid)
-        const user = em.assign(userByUid, { ...userData, points: userByUid.points + Points.PROFILE_EDITED })
+        const user = em.assign(userByUid, { ...userData, points: userByUid.points - Points.PROFILE_EDITED })
         await em.persistAndFlush(user)
         return { user, points: Points.PROFILE_EDITED }
killedBy: UserPostgresRepository updates and returns a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"email": "email", "id": 1, "points": 150, "uid": 1, "username": "username"},
  Object {
    "email": "email",

[Killed] BooleanLiteral
src/repositories/user/userPostgresRepository.ts:89:13
     deleteUser = async (uid: string) => {
         const em = this.orm.forkEm()
         const user = await this.getUserByUid(uid)
-        if (!user.footprints.isInitialized()) {
+        if (user.footprints.isInitialized()) {
             await user.footprints.init()
         }
killedBy: UserPostgresRepository deleteUser initializes footprints if not initialized
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:89:47
     deleteUser = async (uid: string) => {
         const em = this.orm.forkEm()
         const user = await this.getUserByUid(uid)
-        if (!user.footprints.isInitialized()) {
-            await user.footprints.init()
-        }
+        if (!user.footprints.isInitialized()) {}
         user.footprints.removeAll()
         // we can't include repos here due to circular dependency injection in the router
killedBy: UserPostgresRepository deleteUser initializes footprints if not initialized
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrayDeclaration
src/repositories/user/userPostgresRepository.ts:94:63
         }
         user.footprints.removeAll()
         // we can't include repos here due to circular dependency injection in the router
-        const [ friendships, footprints ] = await Promise.all([
-            em.find('Friendship', { $or: [{ invitor: user }, { invitee: user }] }),
-            em.find(
-                'Footprint',
-                { createdBy: user } as any,
-                { populate: ['users'] } as any,
-            ) as Promise<Footprint[]>,
-        ])
+        const [ friendships, footprints ] = await Promise.all([])
         const reactions = await em.find(
             'FootprintReaction',
killedBy: UserPostgresRepository deleteUser deletes a user
statusReason: TypeError: footprints is not iterable

[Killed] ArrayDeclaration
src/repositories/user/userPostgresRepository.ts:95:42
         user.footprints.removeAll()
         // we can't include repos here due to circular dependency injection in the router
         const [ friendships, footprints ] = await Promise.all([
-            em.find('Friendship', { $or: [{ invitor: user }, { invitee: user }] }),
+            em.find('Friendship', { $or: [] }),
             em.find(
                 'Footprint',
killedBy: UserPostgresRepository deleteUser deletes a user
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Received
->     1
          "Friendship",
          Object {

[Killed] ObjectLiteral
src/repositories/user/userPostgresRepository.ts:95:43
         user.footprints.removeAll()
         // we can't include repos here due to circular dependency injection in the router
         const [ friendships, footprints ] = await Promise.all([
-            em.find('Friendship', { $or: [{ invitor: user }, { invitee: user }] }),
+            em.find('Friendship', { $or: [{}, { invitee: user }] }),
             em.find(
                 'Footprint',
killedBy: UserPostgresRepository deleteUser deletes a user
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Received
->     1
          "Friendship",
        @@ -1,18 +1,8 @@

[Killed] ObjectLiteral
src/repositories/user/userPostgresRepository.ts:104:13
         ])
         const reactions = await em.find(
             'FootprintReaction',
-            { $or: [{ createdBy: user }, { footprint: [...footprints] }] },
+            {},
         )
         footprints.forEach((footprint) => {
killedBy: UserPostgresRepository deleteUser deletes a user
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 3
Received
       2: "Footprint", {"createdBy": {"footprints": {"init": [Function mockConstructor], "isInitialized": [Function mockConstructor], "removeAll": [Function mockConstructor]}, "id": 1, "uid": "abc"}}, {"populate": ["users"]}
->     3
          "FootprintReaction",

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:106:43
             'FootprintReaction',
             { $or: [{ createdBy: user }, { footprint: [...footprints] }] },
         )
-        footprints.forEach((footprint) => {
-            footprint.users.removeAll()
-            em.persist(footprint)
-        })
+        footprints.forEach((footprint) => {})
         em.persist(user)
         em.remove(friendships)
killedBy: UserPostgresRepository deleteUser deletes a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:122:56
         return this.deletionService.deleteUser(uid)
     }
 
-    addPoints = async (uid: string, points: number) => {
-        const em = this.orm.forkEm()
-        const user = await this.getUserByUid(uid)
-        const userWithPoints = em.assign(user, { points: user.points + points })
-        try {
-            await em.persistAndFlush(userWithPoints)
-        } catch { /* empty */ }
-        return userWithPoints
-    }
+    addPoints = async (uid: string, points: number) => {}
 }
 
killedBy: UserPostgresRepository addPoints add points to user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArithmeticOperator
src/repositories/user/userPostgresRepository.ts:125:58
     addPoints = async (uid: string, points: number) => {
         const em = this.orm.forkEm()
         const user = await this.getUserByUid(uid)
-        const userWithPoints = em.assign(user, { points: user.points + points })
+        const userWithPoints = em.assign(user, { points: user.points - points })
         try {
             await em.persistAndFlush(userWithPoints)
killedBy: UserPostgresRepository addPoints add points to user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"id": 1, "points": 0, "uid": 1},
  Object {
-   "points": 50,

[Killed] BlockStatement
src/repositories/user/userPostgresRepository.ts:126:13
         const em = this.orm.forkEm()
         const user = await this.getUserByUid(uid)
         const userWithPoints = em.assign(user, { points: user.points + points })
-        try {
-            await em.persistAndFlush(userWithPoints)
-        } catch { /* empty */ }
+        try {} catch { /* empty */ }
         return userWithPoints
     }
killedBy: UserPostgresRepository addPoints add points to user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "user"

Number of calls: 0
