[Killed] BlockStatement
src/router/footprintRouter.ts:44:7
             orm,
         ),
         footprintController: FootprintController = new FootprintController(footprintRepository),
-    ) {
-        this.router = router
-        this.footprintService = footprintService
-        this.footprintController = footprintController
-    }
+    ) {}
 
     getAllFootprintsHandler = (
killedBy: FootprintRouter initializes the constructor with all default values
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrowFunction
src/router/footprintRouter.ts:50:31
         this.footprintController = footprintController
     }
 
-    getAllFootprintsHandler = (
-        _request: Request,
-        response: Response,
-    ) => this.footprintController.getAllFootprints(response)
+    getAllFootprintsHandler = () => undefined
 
     generateGetAllFootprintsRoute = () => {
killedBy: FootprintRouter handler functions handles getAllFootprints
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ArrowFunction
src/router/footprintRouter.ts:86:38
         this.router.get('/all', this.getAllFootprintsHandler)
     }
 
-    createFootprintReactionHandler = (
-        request: Request,
-        response: Response,
-    ) => this.footprintController.createFootprintReaction(
-        {
-            id: request.params.id,
-            message: request.body.message,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    createFootprintReactionHandler = () => undefined
 
     generateCreateFootprintReactionRoute = () => {
killedBy: FootprintRouter handler functions handles createFootprintReaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "message": "test", "uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Survived] ArrayDeclaration
src/router/footprintRouter.ts:140:13
          */
         this.router.post(
             '/:id/reactions',
-            [
-                body('message')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'Message is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Message must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
-            ],
+            [],
             errorHandler,
             this.createFootprintReactionHandler,

[Survived] MethodExpression
src/router/footprintRouter.ts:141:17
         this.router.post(
             '/:id/reactions',
             [
-                body('message')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'Message is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Message must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('message').notEmpty().withMessage({
+  message: 'Message is required',
+  type: AttributeIsMissingError
+}).isString().withMessage({
+  message: 'Message must be a string',
+  type: AttributeInvalidError
+}),
             ],
             errorHandler,

[Survived] StringLiteral
src/router/footprintRouter.ts:145:38
                     .notEmpty()
                     .withMessage(
                         {
-                            message: 'Message is required',
+                            message: "",
                             type: AttributeIsMissingError,
                         },

[Survived] ObjectLiteral
src/router/footprintRouter.ts:151:25
                     )
                     .isString()
                     .withMessage(
-                        {
-                            message: 'Message must be a string',
-                            type: AttributeInvalidError,
-                        },
+                        {},
                     )
                     .trim(),

[Killed] ArrowFunction
src/router/footprintRouter.ts:163:30
         )
     }
 
-    deleteFootprintHandler = (
-        request: Request,
-        response: Response,
-    ) => this.footprintController.deleteFootprint(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    deleteFootprintHandler = () => undefined
 
     generateDeleteFootprintRoute = () => {
killedBy: FootprintRouter handler functions handles deleteFootprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/router/footprintRouter.ts:174:42
         response,
     )
 
-    generateDeleteFootprintRoute = () => {
-        /**
-         * @openapi
-         * /footprints/{id}:
-         *   delete:
-         *     summary: Delete a footprint
-         *     tags:
-         *       - Footprint
-         *     parameters:
-         *       - in: path
-         *         name: id
-         *         schema:
-         *           type: integer
-         *         required: true
-         *         description: Numeric ID of the footprint to delete
-         *     responses:
-         *       204:
-         *         description: Ok
-         *       403:
-         *         $ref: '#/components/responses/Forbidden'
-         *       404:
-         *         $ref: '#/components/responses/NotFound'
-         */
-        this.router.delete('/:id', this.deleteFootprintHandler)
-    }
+    generateDeleteFootprintRoute = () => {}
 
     deleteFootprintReactionHandler = (
killedBy: FootprintRouter routes generates deleteFootprint route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/:id", [Function anonymous]

Number of calls: 0

[Killed] ArrowFunction
src/router/footprintRouter.ts:200:38
         this.router.delete('/:id', this.deleteFootprintHandler)
     }
 
-    deleteFootprintReactionHandler = (
-        request: Request,
-        response: Response,
-    ) => this.footprintController.deleteFootprintReaction(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    deleteFootprintReactionHandler = () => undefined
 
     generateDeleteFootprintReactionRoute = () => {
killedBy: FootprintRouter handler functions handles deleteFootprintReaction
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/router/footprintRouter.ts:211:50
         response,
     )
 
-    generateDeleteFootprintReactionRoute = () => {
-        /**
-         * @openapi
-         * /footprints/reactions/{id}:
-         *   delete:
-         *     summary: Delete a reaction
-         *     tags:
-         *       - Footprint
-         *     parameters:
-         *       - in: path
-         *         name: id
-         *         schema:
-         *           type: integer
-         *         required: true
-         *         description: Numeric ID of the reaction to delete
-         *     responses:
-         *       204:
-         *         description: Ok
-         *       403:
-         *         $ref: '#/components/responses/Forbidden'
-         *       404:
-         *         $ref: '#/components/responses/NotFound'
-         */
-        this.router.delete('/reactions/:id', this.deleteFootprintReactionHandler)
-    }
+    generateDeleteFootprintReactionRoute = () => {}
 
     getFootprintByIdHandler = (request: Request, response: Response) => this.footprintController.getFootprintById(
killedBy: FootprintRouter routes generates deleteFootprintReaction route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/reactions/:id", [Function anonymous]

Number of calls: 0

[Killed] ArrowFunction
src/router/footprintRouter.ts:237:31
         this.router.delete('/reactions/:id', this.deleteFootprintReactionHandler)
     }
 
-    getFootprintByIdHandler = (request: Request, response: Response) => this.footprintController.getFootprintById(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    getFootprintByIdHandler = () => undefined
 
     generateGetFootprintByIdRoute = () => {
killedBy: FootprintRouter handler functions handles getFootprintById
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1, "uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ArrowFunction
src/router/footprintRouter.ts:278:36
         this.router.get('/:id', this.getFootprintByIdHandler)
     }
 
-    getFootprintReactionsHandler = (
-        request: Request,
-        response: Response,
-    ) => this.footprintController.getFootprintReactions(
-        { id: request.params.id },
-        response,
-    )
+    getFootprintReactionsHandler = () => undefined
 
     generateGetFootprintReactionsRoute = () => {
killedBy: FootprintRouter handler functions handles getFootprintReactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 1}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] StringLiteral
src/router/footprintRouter.ts:321:25
          *       500:
          *         $ref: '#/components/responses/InternalServerError'
          */
-        this.router.get('/:id/reactions', this.getFootprintReactionsHandler)
+        this.router.get("", this.getFootprintReactionsHandler)
     }
 
killedBy: FootprintRouter routes generates getFootprintReactions route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/:id/reactions", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] ArrowFunction
src/router/footprintRouter.ts:324:30
         this.router.get('/:id/reactions', this.getFootprintReactionsHandler)
     }
 
-    createFootprintHandler = (request: Request, response: Response) => this.footprintController.createFootprint(
-        {
-            title: request.body.title,
-            description: request.body.description,
-            latitude: request.body.latitude,
-            longitude: request.body.longitude,
-            files: request.files as MulterFiles['files'],
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    createFootprintHandler = () => undefined
 
     generateCreateFootprintRoute = () => {
killedBy: FootprintRouter handler functions handles createFootprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"files": {}, "latitude": "12345678", "longitude": "98765432", "title": "title", "uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/footprintRouter.ts:388:21
             '/',
             this.footprintService.uploadMiddleware.fields(
                 [
-                    { name: 'image', maxCount: 1 },
+                    {},
                     { name: 'audio', maxCount: 1 },
                 ],
killedBy: FootprintRouter routes generates createFootprint route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   Object {
-     "maxCount": 1,

[Killed] StringLiteral
src/router/footprintRouter.ts:389:29
             this.footprintService.uploadMiddleware.fields(
                 [
                     { name: 'image', maxCount: 1 },
-                    { name: 'audio', maxCount: 1 },
+                    { name: "", maxCount: 1 },
                 ],
             ),
killedBy: FootprintRouter routes generates createFootprint route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,8 +3,8 @@
      "maxCount": 1,
      "name": "image",

[Killed] ObjectLiteral
src/router/footprintRouter.ts:389:21
             this.footprintService.uploadMiddleware.fields(
                 [
                     { name: 'image', maxCount: 1 },
-                    { name: 'audio', maxCount: 1 },
+                    {},
                 ],
             ),
killedBy: FootprintRouter routes generates createFootprint route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
    Object {
      "maxCount": 1,

[Survived] MethodExpression
src/router/footprintRouter.ts:393:17
                 ],
             ),
             [
-                body('title')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'Title is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Title must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('title').notEmpty().withMessage({
+  message: 'Title is required',
+  type: AttributeIsMissingError
+}).isString().withMessage({
+  message: 'Title must be a string',
+  type: AttributeInvalidError
+}),
                 body('description')
                     .isString()

[Survived] ObjectLiteral
src/router/footprintRouter.ts:403:25
                     )
                     .isString()
                     .withMessage(
-                        {
-                            message: 'Title must be a string',
-                            type: AttributeInvalidError,
-                        },
+                        {},
                     )
                     .trim(),

[Survived] StringLiteral
src/router/footprintRouter.ts:404:38
                     .isString()
                     .withMessage(
                         {
-                            message: 'Title must be a string',
+                            message: "",
                             type: AttributeInvalidError,
                         },

[Survived] MethodExpression
src/router/footprintRouter.ts:409:17
                         },
                     )
                     .trim(),
-                body('description')
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Description must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('description').isString().withMessage({
+  message: 'Description must be a string',
+  type: AttributeInvalidError
+}),
                 body('latitude')
                     .notEmpty()

[Survived] StringLiteral
src/router/footprintRouter.ts:409:22
                         },
                     )
                     .trim(),
-                body('description')
+                body("")
                     .isString()
                     .withMessage(

[Survived] StringLiteral
src/router/footprintRouter.ts:430:38
                     .notEmpty()
                     .withMessage(
                         {
-                            message: 'Longitude is required',
+                            message: "",
                             type: AttributeIsMissingError,
                         },

[Killed] ArrowFunction
src/router/footprintRouter.ts:440:44
         )
     }
 
-    getFootprintsOfFriendsAndUserHandler = (
-        request: Request,
-        response: Response,
-    ) => this.footprintController.getFootprintsOfFriendsAndUser(
-        { uid: request.headers[String(AUTH_HEADER_UID)] as string },
-        response,
-    )
+    getFootprintsOfFriendsAndUserHandler = () => undefined
 
     generateGetFootprintsOfFriendsAndUserRoute = () => {
killedBy: FootprintRouter handler functions handles getFootprintsOfFriendsAndUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/router/footprintRouter.ts:479:35
         this.router.get('/', this.getFootprintsOfFriendsAndUserHandler)
     }
 
-    createAndReturnRoutes = () => {
-        this.generateGetAllFootprintsRoute()
-        this.generateGetFootprintsOfFriendsAndUserRoute()
-        this.generateCreateFootprintReactionRoute()
-        this.generateDeleteFootprintReactionRoute()
-        this.generateDeleteFootprintRoute()
-        this.generateGetFootprintByIdRoute()
-        this.generateGetFootprintReactionsRoute()
-        this.generateCreateFootprintRoute()
-
-        return this.router
-    }
+    createAndReturnRoutes = () => {}
 }
 
killedBy: FootprintRouter creates all routes and returns router
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: serializes to the same string
