[Killed] BlockStatement
src/router/friendshipRouter.ts:29:7
         userRepository: UserRepositoryInterface = new UserPostgresRepository(userService, deletionService, orm),
         friendshipRepository: FriendshipRepositoryInterface = new FriendshipPostgresRepository(userRepository, orm),
         friendshipController: FriendshipController = new FriendshipController(friendshipRepository, userRepository),
-    ) {
-        this.router = router
-        this.friendshipController = friendshipController
-    }
+    ) {}
 
     getFriendshipsHandler = (request: Request, response: Response) => this.friendshipController.getFriendshipsByUid(
killedBy: FriendshipRouter initializes the constructor with all default values
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrowFunction
src/router/friendshipRouter.ts:34:29
         this.friendshipController = friendshipController
     }
 
-    getFriendshipsHandler = (request: Request, response: Response) => this.friendshipController.getFriendshipsByUid(
-        { userId: String(request.query.userId) },
-        response,
-    )
+    getFriendshipsHandler = () => undefined
 
     generateGetAllFriendshipsRoute = () => {
killedBy: FriendshipRouter handler functions handles getFriendships
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"userId": "1"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/friendshipRouter.ts:35:9
     }
 
     getFriendshipsHandler = (request: Request, response: Response) => this.friendshipController.getFriendshipsByUid(
-        { userId: String(request.query.userId) },
+        {},
         response,
     )
killedBy: FriendshipRouter handler functions handles getFriendships
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "userId": "1",
- }

[Killed] StringLiteral
src/router/friendshipRouter.ts:75:25
          *      404:
          *        $ref: '#/components/responses/NotFound'
          */
-        this.router.get('/', this.getFriendshipsHandler)
+        this.router.get("", this.getFriendshipsHandler)
     }
 
killedBy: FriendshipRouter routes generates getFriendships route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] ArrowFunction
src/router/friendshipRouter.ts:78:31
         this.router.get('/', this.getFriendshipsHandler)
     }
 
-    createFriendshipHandler = (request: Request, response: Response) => this.friendshipController.createFriendship(
-        { friendsCode: request.body.friendsCode, uid: request.headers[String(AUTH_HEADER_UID)] as string },
-        response,
-    )
+    createFriendshipHandler = () => undefined
 
     generateCreateFriendshipRoute = () => {
killedBy: FriendshipRouter handler functions handles createFriendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"friendsCode": "friendsCode", "uid": 1}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/friendshipRouter.ts:79:9
     }
 
     createFriendshipHandler = (request: Request, response: Response) => this.friendshipController.createFriendship(
-        { friendsCode: request.body.friendsCode, uid: request.headers[String(AUTH_HEADER_UID)] as string },
+        {},
         response,
     )
killedBy: FriendshipRouter handler functions handles createFriendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "friendsCode": "friendsCode",
-   "uid": 1,

[Killed] StringLiteral
src/router/friendshipRouter.ts:123:13
          *         $ref: '#/components/responses/NotFound'
          */
         this.router.post(
-            '/',
+            "",
             [
                 body('friendsCode')
killedBy: FriendshipRouter routes generates createFriendship route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", Any<Array>, "errorHandler", [Function anonymous]
Received: "", [[Function middleware]], "errorHandler", [Function anonymous]

Number of calls: 1

[Survived] MethodExpression
src/router/friendshipRouter.ts:125:17
         this.router.post(
             '/',
             [
-                body('friendsCode')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'FriendsCode is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .trim(),
+                body('friendsCode').notEmpty().withMessage({
+  message: 'FriendsCode is required',
+  type: AttributeIsMissingError
+}),
             ],
             errorHandler,

[Survived] ObjectLiteral
src/router/friendshipRouter.ts:128:25
                 body('friendsCode')
                     .notEmpty()
                     .withMessage(
-                        {
-                            message: 'FriendsCode is required',
-                            type: AttributeIsMissingError,
-                        },
+                        {},
                     )
                     .trim(),

[Survived] StringLiteral
src/router/friendshipRouter.ts:129:38
                     .notEmpty()
                     .withMessage(
                         {
-                            message: 'FriendsCode is required',
+                            message: "",
                             type: AttributeIsMissingError,
                         },

[Killed] ArrowFunction
src/router/friendshipRouter.ts:140:31
         )
     }
 
-    acceptFriendshipHandler = (request: Request, response: Response) => this.friendshipController.acceptFriendship(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    acceptFriendshipHandler = () => undefined
 
     generateAcceptFriendshipRoute = () => {
killedBy: FriendshipRouter handler functions handles acceptFriendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 123, "uid": 1}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/friendshipRouter.ts:141:9
     }
 
     acceptFriendshipHandler = (request: Request, response: Response) => this.friendshipController.acceptFriendship(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
+        {},
         response,
     )
killedBy: FriendshipRouter handler functions handles acceptFriendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "id": 123,
-   "uid": 1,

[Killed] ArrowFunction
src/router/friendshipRouter.ts:183:40
         this.router.patch('/:id', this.acceptFriendshipHandler)
     }
 
-    declineOrDeleteFriendshipHandler = (
-        request: Request,
-        response: Response,
-    ) => this.friendshipController.declineOrDeleteFriendship(
-        {
-            id: request.params.id,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    declineOrDeleteFriendshipHandler = () => undefined
 
     generateDeclineOrDeleteFriendshipRoute = () => {
killedBy: FriendshipRouter handler functions handles declineOrDeleteFriendship
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 123, "uid": 1}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] BlockStatement
src/router/friendshipRouter.ts:194:52
         response,
     )
 
-    generateDeclineOrDeleteFriendshipRoute = () => {
-        /**
-         * @openapi
-         * /friendships/{id}:
-         *   delete:
-         *     summary: Delete a friendship
-         *     tags:
-         *       - Friendship
-         *     parameters:
-         *       - in: path
-         *         name: id
-         *         required: true
-         *         schema:
-         *           type: integer
-         *           description: Numeric ID of the friendship to delete
-         *     responses:
-         *       204:
-         *         description: Ok
-         *       403:
-         *         $ref: '#/components/responses/Forbidden'
-         *       404:
-         *         $ref: '#/components/responses/NotFound'
-         */
-        this.router.delete('/:id', this.declineOrDeleteFriendshipHandler)
-    }
+    generateDeclineOrDeleteFriendshipRoute = () => {}
 
     createAndReturnRoutes = () => {
killedBy: FriendshipRouter routes generates declineOrDeleteFriendship route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/:id", [Function anonymous]

Number of calls: 0

[Killed] BlockStatement
src/router/friendshipRouter.ts:220:35
         this.router.delete('/:id', this.declineOrDeleteFriendshipHandler)
     }
 
-    createAndReturnRoutes = () => {
-        this.generateGetAllFriendshipsRoute()
-        this.generateCreateFriendshipRoute()
-        this.generateAcceptFriendshipRoute()
-        this.generateDeclineOrDeleteFriendshipRoute()
-
-        return this.router
-    }
+    createAndReturnRoutes = () => {}
 }
 
killedBy: FriendshipRouter creates all routes and returns router
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: serializes to the same string
