[Killed] BlockStatement
src/router/leaderboardRouter.ts:18:7
         orm: ORM,
         leaderboardRepository: LeaderboardRepositoryInterface = new LeaderboardPostgresRepository(orm),
         leaderboardController: LeaderboardController = new LeaderboardController(leaderboardRepository),
-    ) {
-        this.router = router
-        this.leaderboardController = leaderboardController
-    }
+    ) {}
 
     getTop100Handler = (_request: Request, response: Response) => this.leaderboardController.getTop100(
killedBy: LeaderboardRouter initializes the constructor with all default values
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrowFunction
src/router/leaderboardRouter.ts:23:24
         this.leaderboardController = leaderboardController
     }
 
-    getTop100Handler = (_request: Request, response: Response) => this.leaderboardController.getTop100(
-        response,
-    )
+    getTop100Handler = () => undefined
 
     generateGetLeaderboardRoute = () => {
killedBy: LeaderboardRouter handler functions handles getTop100
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] StringLiteral
src/router/leaderboardRouter.ts:51:25
          *                  type: object
          *                  default: {}
          */
-        this.router.get('/', this.getTop100Handler)
+        this.router.get("", this.getTop100Handler)
     }
 
killedBy: LeaderboardRouter routes generates getLeaderboard route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] BlockStatement
src/router/leaderboardRouter.ts:54:35
         this.router.get('/', this.getTop100Handler)
     }
 
-    createAndReturnRoutes = () => {
-        this.generateGetLeaderboardRoute()
-        return this.router
-    }
+    createAndReturnRoutes = () => {}
 }
 
killedBy: LeaderboardRouter creates all routes and returns router
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: serializes to the same string
