[Killed] BlockStatement
src/router/userRouter.ts:27:7
         deletionService: DeletionService = new DeletionService(),
         userRepository: UserRepositoryInterface = new UserPostgresRepository(userService, deletionService, orm),
         userController: UserController = new UserController(userRepository),
-    ) {
-        this.router = router
-        this.userController = userController
-    }
+    ) {}
 
     getAllUsersHandler = (_request: Request, response: Response) => this.userController.getAllUsers(response)
killedBy: UserRouter initializes the constructor with all default values
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ArrowFunction
src/router/userRouter.ts:32:26
         this.userController = userController
     }
 
-    getAllUsersHandler = (_request: Request, response: Response) => this.userController.getAllUsers(response)
+    getAllUsersHandler = () => undefined
 
     generateAllUsersRoute = () => {
killedBy: UserRouter handler functions handles getAllUsers
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] StringLiteral
src/router/userRouter.ts:60:25
          *       403:
          *         $ref: '#/components/responses/Forbidden'
          */
-        this.router.get('/', this.getAllUsersHandler)
+        this.router.get("", this.getAllUsersHandler)
     }
 
killedBy: UserRouter routes generates getAllUsers route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] ArrowFunction
src/router/userRouter.ts:63:26
         this.router.get('/', this.getAllUsersHandler)
     }
 
-    getUserByIdHandler = (request: Request, response: Response) => this.userController.getUserById(
-        { id: request.params.id },
-        response,
-    )
+    getUserByIdHandler = () => undefined
 
     generateGetUserByIdRoute = () => {
killedBy: UserRouter handler functions handles getUserById
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"id": 3}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ArrowFunction
src/router/userRouter.ts:104:27
         this.router.get('/:id', this.getUserByIdHandler)
     }
 
-    getUserByUidHandler = (request: Request, response: Response) => this.userController.getUserByUid(
-        { uid: request.params.uid },
-        response,
-    )
+    getUserByUidHandler = () => undefined
 
     generateGetUserByUidRoute = () => {
killedBy: UserRouter handler functions handles getUserByUid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"uid": 3}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/userRouter.ts:105:9
     }
 
     getUserByUidHandler = (request: Request, response: Response) => this.userController.getUserByUid(
-        { uid: request.params.uid },
+        {},
         response,
     )
killedBy: UserRouter handler functions handles getUserByUid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "uid": 3,
- }

[Killed] ArrowFunction
src/router/userRouter.ts:145:35
         this.router.get('/uid/:uid', this.getUserByUidHandler)
     }
 
-    getUserByFriendsCodeHandler = (request: Request, response: Response) => this.userController.getUserByFriendsCode(
-        { fc: request.params.fc },
-        response,
-    )
+    getUserByFriendsCodeHandler = () => undefined
 
     generateGetUserByFriendsCodeRoute = () => {
killedBy: UserRouter handler functions handles getUserByFriendsCode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"fc": 3}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/userRouter.ts:146:9
     }
 
     getUserByFriendsCodeHandler = (request: Request, response: Response) => this.userController.getUserByFriendsCode(
-        { fc: request.params.fc },
+        {},
         response,
     )
killedBy: UserRouter handler functions handles getUserByFriendsCode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "fc": 3,
- }

[Killed] StringLiteral
src/router/userRouter.ts:183:25
          *       404:
          *         $ref: '#/components/responses/NotFound'
          */
-        this.router.get('/fc/:fc', this.getUserByFriendsCodeHandler)
+        this.router.get("", this.getUserByFriendsCodeHandler)
     }
 
killedBy: UserRouter routes generates getUserByFriendsCode route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/fc/:fc", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] ArrowFunction
src/router/userRouter.ts:186:25
         this.router.get('/fc/:fc', this.getUserByFriendsCodeHandler)
     }
 
-    createUserHandler = (request: Request, response: Response) => this.userController.createUser(
-        {
-            email: request.body.email,
-            username: request.body.username,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    createUserHandler = () => undefined
 
     generateCreateUserRoute = () => {
killedBy: UserRouter handler functions handles createUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@test.at", "uid": "uid", "username": "username"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Survived] MethodExpression
src/router/userRouter.ts:251:17
         this.router.post(
             '/',
             [
-                body('email')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'Email is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .isEmail()
-                    .withMessage(
-                        {
-                            message: 'Email is invalid',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('email').notEmpty().withMessage({
+  message: 'Email is required',
+  type: AttributeIsMissingError
+}).isEmail().withMessage({
+  message: 'Email is invalid',
+  type: AttributeInvalidError
+}),
                 body('username')
                     .notEmpty()

[Survived] StringLiteral
src/router/userRouter.ts:251:22
         this.router.post(
             '/',
             [
-                body('email')
+                body("")
                     .notEmpty()
                     .withMessage(

[Survived] MethodExpression
src/router/userRouter.ts:267:17
                         },
                     )
                     .trim(),
-                body('username')
-                    .notEmpty()
-                    .withMessage(
-                        {
-                            message: 'Username is required',
-                            type: AttributeIsMissingError,
-                        },
-                    )
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Username must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('username').notEmpty().withMessage({
+  message: 'Username is required',
+  type: AttributeIsMissingError
+}).isString().withMessage({
+  message: 'Username must be a string',
+  type: AttributeInvalidError
+}),
             ],
             errorHandler,

[Survived] StringLiteral
src/router/userRouter.ts:271:38
                     .notEmpty()
                     .withMessage(
                         {
-                            message: 'Username is required',
+                            message: "",
                             type: AttributeIsMissingError,
                         },

[Survived] StringLiteral
src/router/userRouter.ts:278:38
                     .isString()
                     .withMessage(
                         {
-                            message: 'Username must be a string',
+                            message: "",
                             type: AttributeInvalidError,
                         },

[Killed] ArrowFunction
src/router/userRouter.ts:289:25
         )
     }
 
-    updateUserHandler = (request: Request, response: Response) => this.userController.updateUser(
-        {
-            email: request.body.email,
-            username: request.body.username,
-            uid: request.headers[String(AUTH_HEADER_UID)] as string,
-        },
-        response,
-    )
+    updateUserHandler = () => undefined
 
     generateUpdateUserRoute = () => {
killedBy: UserRouter handler functions handles updateUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@test.at", "uid": "uid", "username": "username"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Survived] MethodExpression
src/router/userRouter.ts:352:17
         this.router.patch(
             '/',
             [
-                body('email')
-                    .isEmail()
-                    .withMessage(
-                        {
-                            message: 'Email is invalid',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('email').isEmail().withMessage({
+  message: 'Email is invalid',
+  type: AttributeInvalidError
+}),
                 body('username')
                     .isString()

[Survived] MethodExpression
src/router/userRouter.ts:361:17
                         },
                     )
                     .trim(),
-                body('username')
-                    .isString()
-                    .withMessage(
-                        {
-                            message: 'Username must be a string',
-                            type: AttributeInvalidError,
-                        },
-                    )
-                    .trim(),
+                body('username').isString().withMessage({
+  message: 'Username must be a string',
+  type: AttributeInvalidError
+}),
             ],
             errorHandler,

[Survived] StringLiteral
src/router/userRouter.ts:361:22
                         },
                     )
                     .trim(),
-                body('username')
+                body("")
                     .isString()
                     .withMessage(

[Killed] ArrowFunction
src/router/userRouter.ts:376:25
         )
     }
 
-    deleteUserHandler = (request: Request, response: Response) => this.userController.deleteUser(
-        { uid: request.headers[String(AUTH_HEADER_UID)] as string },
-        response,
-    )
+    deleteUserHandler = () => undefined
 
     generateDeleteUserRoute = () => {
killedBy: UserRouter handler functions handles deleteUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"uid": "uid"}, {"json": [Function mockConstructor], "send": [Function mockConstructor], "sendStatus": [Function mockConstructor], "setHeader": [Function mockConstructor], "status": [Function mockConstructor]}

Number of calls: 0

[Killed] ObjectLiteral
src/router/userRouter.ts:377:9
     }
 
     deleteUserHandler = (request: Request, response: Response) => this.userController.deleteUser(
-        { uid: request.headers[String(AUTH_HEADER_UID)] as string },
+        {},
         response,
     )
killedBy: UserRouter handler functions handles deleteUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "uid": "uid",
- }

[Killed] BlockStatement
src/router/userRouter.ts:381:37
         response,
     )
 
-    generateDeleteUserRoute = () => {
-        /**
-         * @openapi
-         * /users:
-         *   delete:
-         *     summary: Delete a user
-         *     tags:
-         *       - User
-         *     responses:
-         *       204:
-         *         description: Ok
-         *       403:
-         *         $ref: '#/components/responses/Forbidden'
-         *       404:
-         *         $ref: '#/components/responses/NotFound'
-         */
-        this.router.delete('/', this.deleteUserHandler)
-    }
+    generateDeleteUserRoute = () => {}
 
     createAndReturnRoutes = () => {
killedBy: UserRouter routes generates deleteUser route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", [Function anonymous]

Number of calls: 0

[Killed] StringLiteral
src/router/userRouter.ts:397:28
          *       404:
          *         $ref: '#/components/responses/NotFound'
          */
-        this.router.delete('/', this.deleteUserHandler)
+        this.router.delete("", this.deleteUserHandler)
     }
 
killedBy: UserRouter routes generates deleteUser route
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/", [Function anonymous]
Received: "", [Function anonymous]

Number of calls: 1

[Killed] BlockStatement
src/router/userRouter.ts:400:35
         this.router.delete('/', this.deleteUserHandler)
     }
 
-    createAndReturnRoutes = () => {
-        this.generateAllUsersRoute()
-        this.generateGetUserByIdRoute()
-        this.generateGetUserByUidRoute()
-        this.generateGetUserByFriendsCodeRoute()
-        this.generateCreateUserRoute()
-        this.generateUpdateUserRoute()
-        this.generateDeleteUserRoute()
-
-        return this.router
-    }
+    createAndReturnRoutes = () => {}
 }
 
killedBy: UserRouter creates all routes and returns router
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: serializes to the same string
