[Killed] BlockStatement
src/router.ts:25:48
 
     private readonly orm: ORM
 
-    constructor(server: Application, orm: ORM) {
-        this.server = server
-        this.orm = orm
-    }
+    constructor(server: Application, orm: ORM) {}
 
     createRequestContext = (_request: Request, _response: Response, next: NextFunction) => {
killedBy: Router general setup creates the RequestContext for the orm
statusReason: TypeError: Cannot read properties of undefined (reading 'use')

[Killed] BlockStatement
src/router.ts:30:92
         this.orm = orm
     }
 
-    createRequestContext = (_request: Request, _response: Response, next: NextFunction) => {
-        RequestContext.create(this.orm.orm.em, next)
-    }
+    createRequestContext = (_request: Request, _response: Response, next: NextFunction) => {}
 
     custom404 = (_request: Request, response: Response) => {
killedBy: Router general setup creates the RequestContext for the orm
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: undefined, [Function mockConstructor]

Number of calls: 0

[Killed] BlockStatement
src/router.ts:34:60
         RequestContext.create(this.orm.orm.em, next)
     }
 
-    custom404 = (_request: Request, response: Response) => {
-        ResponseSender.error(response, NotFoundError.getErrorDocument())
-    }
+    custom404 = (_request: Request, response: Response) => {}
 
     custom500 = (error: ErrorRequestHandler, _request: Request, response: Response) => {
killedBy: Router general setup creates custom 404 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
src/router.ts:38:88
         ResponseSender.error(response, NotFoundError.getErrorDocument())
     }
 
-    custom500 = (error: ErrorRequestHandler, _request: Request, response: Response) => {
-        console.error(error)
-        ResponseSender.error(response, InternalServerError.getErrorDocument('Internal Server Error'))
-    }
+    custom500 = (error: ErrorRequestHandler, _request: Request, response: Response) => {}
 
     sentryErrorHandlingOptions = () => ({
killedBy: Router general setup creates custom 500 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: test]

Number of calls: 0

[Killed] ArrowFunction
src/router.ts:43:34
         ResponseSender.error(response, InternalServerError.getErrorDocument('Internal Server Error'))
     }
 
-    sentryErrorHandlingOptions = () => ({
-        shouldHandleError: () => true,
-    })
+    sentryErrorHandlingOptions = () => undefined
 
     initRoutes = (
killedBy: Router general setup set sentry error handling object
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
src/router.ts:44:34
     }
 
     sentryErrorHandlingOptions = () => ({
-        shouldHandleError: () => true,
+        shouldHandleError: () => false,
     })
 
killedBy: Router general setup set sentry error handling object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/router.ts:44:28
     }
 
     sentryErrorHandlingOptions = () => ({
-        shouldHandleError: () => true,
+        shouldHandleError: () => undefined,
     })
 
killedBy: Router general setup set sentry error handling object
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/router.ts:56:35
 
         this.server.use(actuator(actuatorConfig))
 
-        routes.forEach((route) => {
-            this.server.use(
-                route.path,
-                authMiddleware(auth),
-                // eslint-disable-next-line new-cap
-                new route.routerClass(ExpressRouter(), this.orm).createAndReturnRoutes(),
-            )
-        })
+        routes.forEach((route) => {})
 
         this.server.use('/firebase', basicAuth(), firebaseRoutes)
killedBy: Router dynamic route generation dynamically generates routes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] StringLiteral
src/router.ts:67:40
 
         this.server.use('/firebase', basicAuth(), firebaseRoutes)
 
-        this.server.set('view engine', 'ejs')
+        this.server.set('view engine', "")
         this.server.set('views', join(currentPath.default, './views'))
         this.server.use('/admin', basicAuth(), new AdminRouter(ExpressRouter(), this.orm).createAndReturnRoutes())

[Survived] StringLiteral
src/router.ts:68:60
         this.server.use('/firebase', basicAuth(), firebaseRoutes)
 
         this.server.set('view engine', 'ejs')
-        this.server.set('views', join(currentPath.default, './views'))
+        this.server.set('views', join(currentPath.default, ""))
         this.server.use('/admin', basicAuth(), new AdminRouter(ExpressRouter(), this.orm).createAndReturnRoutes())
 
