[Killed] BlockStatement
src/services/deletionService.ts:9:74
 
     readonly auth: Auth
 
-    constructor(storage: Storage = getStorage(), auth: Auth = getAuth()) {
-        this.storage = storage
-        this.auth = auth
-    }
+    constructor(storage: Storage = getStorage(), auth: Auth = getAuth()) {}
 
     refFromUrl = (url: string): string => {
killedBy: DeletionService initializes default storage and auth
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "getStorage"
Received: undefined

[Killed] BlockStatement
src/services/deletionService.ts:14:43
         this.auth = auth
     }
 
-    refFromUrl = (url: string): string => {
-        const BASEURL = `https://firebasestorage.googleapis.com/v0/b/${process.env.FIREBASE_STORAGE_BUCKET}/o/`
-
-        let imagePath: string = url.replace(BASEURL, '')
-
-        imagePath = imagePath.slice(0, Math.max(0, imagePath.indexOf('?')))
-        imagePath = imagePath.replace(/%2F/g, '/')
-        return imagePath.replace(/%20/g, ' ')
-    }
+    refFromUrl = (url: string): string => {}
 
     deleteUser = async (uid: string) => this.auth.deleteUser(uid)
killedBy: DeletionService returns the firebase storage ref from an url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio files/userId/test.mp3"
Received: undefined

[Killed] MethodExpression
src/services/deletionService.ts:19:21
 
         let imagePath: string = url.replace(BASEURL, '')
 
-        imagePath = imagePath.slice(0, Math.max(0, imagePath.indexOf('?')))
+        imagePath = imagePath
         imagePath = imagePath.replace(/%2F/g, '/')
         return imagePath.replace(/%20/g, ' ')
killedBy: DeletionService returns the firebase storage ref from an url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio files/userId/test.mp3"
Received: "audio files/userId/test.mp3?alt=media&token=token"

[Killed] StringLiteral
src/services/deletionService.ts:20:47
         let imagePath: string = url.replace(BASEURL, '')
 
         imagePath = imagePath.slice(0, Math.max(0, imagePath.indexOf('?')))
-        imagePath = imagePath.replace(/%2F/g, '/')
+        imagePath = imagePath.replace(/%2F/g, "")
         return imagePath.replace(/%20/g, ' ')
     }
killedBy: DeletionService returns the firebase storage ref from an url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio files/userId/test.mp3"
Received: "audio filesuserIdtest.mp3"

[Killed] StringLiteral
src/services/deletionService.ts:21:42
 
         imagePath = imagePath.slice(0, Math.max(0, imagePath.indexOf('?')))
         imagePath = imagePath.replace(/%2F/g, '/')
-        return imagePath.replace(/%20/g, ' ')
+        return imagePath.replace(/%20/g, "")
     }
 
killedBy: DeletionService returns the firebase storage ref from an url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audio files/userId/test.mp3"
Received: "audiofiles/userId/test.mp3"

[Killed] ArrowFunction
src/services/deletionService.ts:24:18
         return imagePath.replace(/%20/g, ' ')
     }
 
-    deleteUser = async (uid: string) => this.auth.deleteUser(uid)
+    deleteUser = () => undefined
 
     deleteFilesOfOneFootprint = async (audioUrl: string, imageUrl: string) => {
killedBy: DeletionService deletes a user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "userId"

Number of calls: 0

[Killed] BlockStatement
src/services/deletionService.ts:26:79
 
     deleteUser = async (uid: string) => this.auth.deleteUser(uid)
 
-    deleteFilesOfOneFootprint = async (audioUrl: string, imageUrl: string) => {
-        const bucket = this.storage.bucket()
-        return Promise.all([
-            bucket.deleteFiles({ prefix: this.refFromUrl(audioUrl) }),
-            bucket.deleteFiles({ prefix: this.refFromUrl(imageUrl) }),
-        ])
-    }
+    deleteFilesOfOneFootprint = async (audioUrl: string, imageUrl: string) => {}
 
     deleteAllUserFiles = async (uid: string) => {
killedBy: DeletionService deletes all files of one footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Any<Promise>, Any<Promise>]

Number of calls: 0

[Killed] ArrayDeclaration
src/services/deletionService.ts:28:28
 
     deleteFilesOfOneFootprint = async (audioUrl: string, imageUrl: string) => {
         const bucket = this.storage.bucket()
-        return Promise.all([
-            bucket.deleteFiles({ prefix: this.refFromUrl(audioUrl) }),
-            bucket.deleteFiles({ prefix: this.refFromUrl(imageUrl) }),
-        ])
+        return Promise.all([])
     }
 
killedBy: DeletionService deletes all files of one footprint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Any<Promise>,
-   Any<Promise>,

[Killed] BlockStatement
src/services/deletionService.ts:34:49
         ])
     }
 
-    deleteAllUserFiles = async (uid: string) => {
-        const bucket = this.storage.bucket()
-        return Promise.all([
-            bucket.deleteFiles({ prefix: `audios/${uid}/` }),
-            bucket.deleteFiles({ prefix: `images/${uid}/` }),
-        ])
-    }
+    deleteAllUserFiles = async (uid: string) => {}
 }
 
killedBy: DeletionService deletes all user files
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Any<Promise>, Any<Promise>]

Number of calls: 0

[Killed] ArrayDeclaration
src/services/deletionService.ts:36:28
 
     deleteAllUserFiles = async (uid: string) => {
         const bucket = this.storage.bucket()
-        return Promise.all([
-            bucket.deleteFiles({ prefix: `audios/${uid}/` }),
-            bucket.deleteFiles({ prefix: `images/${uid}/` }),
-        ])
+        return Promise.all([])
     }
 }
killedBy: DeletionService deletes all user files
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Array [
-   Any<Promise>,
-   Any<Promise>,

[Killed] ObjectLiteral
src/services/deletionService.ts:38:32
         const bucket = this.storage.bucket()
         return Promise.all([
             bucket.deleteFiles({ prefix: `audios/${uid}/` }),
-            bucket.deleteFiles({ prefix: `images/${uid}/` }),
+            bucket.deleteFiles({}),
         ])
     }
killedBy: DeletionService deletes all user files
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"prefix": "images/userId/"}
Received
       1
          Object {
        -   "prefix": "images/userId/",
        +   "prefix": "audios/userId/",
