[Killed] BlockStatement
src/services/footprintService.ts:11:50
 export class FootprintService {
     readonly storage: Storage
 
-    constructor(storage: Storage = getStorage()) {
-        this.storage = storage
-    }
+    constructor(storage: Storage = getStorage()) {}
 
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
killedBy: FootprintService initializes default storage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "getStorage"
Received: undefined

[Killed] BlockStatement
src/services/footprintService.ts:15:87
         this.storage = storage
     }
 
-    fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
-        const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
-        if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
-            && value.fieldname === 'image') {
-            return `images${path}`
-        }
-        if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
-            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
-            return `audios${path}`
-        }
-        if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
-            return `videos${path}`
-        }
-        return ''
-    }
+    fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {}
 
     createPersistentDownloadUrl = (
killedBy: FootprintService generates full path for image with mimetype image/jpeg and name fooImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/hsjf/fooImage.jpeg"
Received: undefined

[Killed] StringLiteral
src/services/footprintService.ts:16:22
     }
 
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
-        const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
+        const path = ``
         if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
             && value.fieldname === 'image') {
killedBy: FootprintService generates full path for image with mimetype image/jpeg and name fooImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/hsjf/fooImage.jpeg"
Received: "images"

[Killed] ConditionalExpression
src/services/footprintService.ts:17:49
 
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
         const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
-        if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
+        if ((value.mimetype === 'image/jpeg' || false || value.mimetype === 'image/jpg')
             && value.fieldname === 'image') {
             return `images${path}`
killedBy: FootprintService generates full path for image with mimetype image/png and name barImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/67dh/barImage.png"
Received: ""

[Killed] EqualityOperator
src/services/footprintService.ts:17:83
 
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
         const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
-        if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
+        if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype !== 'image/jpg')
             && value.fieldname === 'image') {
             return `images${path}`
killedBy: FootprintService generates full path for image with mimetype image/jpg and name sampleImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/dfg45/sampleImage.jpg"
Received: ""

[Killed] EqualityOperator
src/services/footprintService.ts:18:16
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
         const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
         if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
-            && value.fieldname === 'image') {
+            && value.fieldname !== 'image') {
             return `images${path}`
         }
killedBy: FootprintService generates full path for image with mimetype image/jpeg and name fooImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/hsjf/fooImage.jpeg"
Received: ""

[Killed] ConditionalExpression
src/services/footprintService.ts:18:16
     fullPath = (value: Express.Multer.File, fileName: string, uid: string): string => {
         const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
         if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
-            && value.fieldname === 'image') {
+            && true) {
             return `images${path}`
         }
killedBy: FootprintService generates full path for video with mimetype image/jpeg and name 34qt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "images/invalidMimeType/34qt.jpeg"

[Killed] StringLiteral
src/services/footprintService.ts:19:20
         const path = `/${uid}/${fileName}.${value.mimetype.split('/')[1]}`
         if ((value.mimetype === 'image/jpeg' || value.mimetype === 'image/png' || value.mimetype === 'image/jpg')
             && value.fieldname === 'image') {
-            return `images${path}`
+            return ``
         }
         if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
killedBy: FootprintService generates full path for image with mimetype image/jpeg and name fooImage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "images/hsjf/fooImage.jpeg"
Received: ""

[Killed] ConditionalExpression
src/services/footprintService.ts:21:14
             && value.fieldname === 'image') {
             return `images${path}`
         }
-        if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
-            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
+        if ((true) && value.fieldname === 'audio') {
             return `audios${path}`
         }
killedBy: FootprintService generates full path for audio with mimetype application/json and name f8i
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "audios/invalidMimeType/f8i.json"

[Killed] ConditionalExpression
src/services/footprintService.ts:21:13
             && value.fieldname === 'image') {
             return `images${path}`
         }
-        if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
-            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
+        if (true) {
             return `audios${path}`
         }
killedBy: FootprintService generates full path for video with mimetype video/mp4 and name fooVideo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "videos/fdsag/fooVideo.mp4"
Received: "audios/fdsag/fooVideo.mp4"

[Killed] BlockStatement
src/services/footprintService.ts:22:80
             return `images${path}`
         }
         if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
-            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
-            return `audios${path}`
-        }
+            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {}
         if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
             return `videos${path}`
killedBy: FootprintService generates full path for audio with mimetype audio/mpeg and name fooAudio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audios/sfdgk/fooAudio.mpeg"
Received: ""

[Killed] EqualityOperator
src/services/footprintService.ts:22:16
             return `images${path}`
         }
         if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
-            || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
+            || value.mimetype !== 'audio/wav') && value.fieldname === 'audio') {
             return `audios${path}`
         }
killedBy: FootprintService generates full path for audio with mimetype application/json and name f8i
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "audios/invalidMimeType/f8i.json"

[Killed] StringLiteral
src/services/footprintService.ts:23:20
         }
         if ((value.mimetype === 'audio/mpeg' || value.mimetype === 'audio/mp3' || value.mimetype === 'audio/aac'
             || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
-            return `audios${path}`
+            return ``
         }
         if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
killedBy: FootprintService generates full path for audio with mimetype audio/mpeg and name fooAudio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "audios/sfdgk/fooAudio.mpeg"
Received: ""

[Killed] BlockStatement
src/services/footprintService.ts:25:76
             || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
             return `audios${path}`
         }
-        if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
-            return `videos${path}`
-        }
+        if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {}
         return ''
     }
killedBy: FootprintService generates full path for video with mimetype video/mp4 and name fooVideo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "videos/fdsag/fooVideo.mp4"
Received: ""

[Killed] ConditionalExpression
src/services/footprintService.ts:25:13
             || value.mimetype === 'audio/wav') && value.fieldname === 'audio') {
             return `audios${path}`
         }
-        if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
+        if (true) {
             return `videos${path}`
         }
killedBy: FootprintService generates full path for video with mimetype image/jpeg and name 34qt
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "videos/invalidMimeType/34qt.jpeg"

[Killed] StringLiteral
src/services/footprintService.ts:26:20
             return `audios${path}`
         }
         if (value.mimetype === 'video/mp4' && value.fieldname === 'video') {
-            return `videos${path}`
+            return ``
         }
         return ''
killedBy: FootprintService generates full path for video with mimetype video/mp4 and name fooVideo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "videos/fdsag/fooVideo.mp4"
Received: ""

[Killed] ArrowFunction
src/services/footprintService.ts:31:35
         return ''
     }
 
-    createPersistentDownloadUrl = (
-        bucket: string,
-        pathToFile: string,
-        downloadToken: string,
-        // eslint-disable-next-line max-len
-    ) => `https://firebasestorage.googleapis.com/v0/b/${bucket}/o/${encodeURIComponent(pathToFile)}?alt=media&token=${downloadToken}`
+    createPersistentDownloadUrl = () => undefined
 
     uploadFilesToFireStorage = async (files: MulterFiles['files'], uid: string) => {
killedBy: FootprintService creates persistent download Url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://firebasestorage.googleapis.com/v0/b/bucketString/o/path%3F%C3%84%26?alt=media&token=token"
Received: undefined

[Killed] StringLiteral
src/services/footprintService.ts:36:10
         pathToFile: string,
         downloadToken: string,
         // eslint-disable-next-line max-len
-    ) => `https://firebasestorage.googleapis.com/v0/b/${bucket}/o/${encodeURIComponent(pathToFile)}?alt=media&token=${downloadToken}`
+    ) => ``
 
     uploadFilesToFireStorage = async (files: MulterFiles['files'], uid: string) => {
killedBy: FootprintService creates persistent download Url
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://firebasestorage.googleapis.com/v0/b/bucketString/o/path%3F%C3%84%26?alt=media&token=token"
Received: ""

[Killed] ArrayDeclaration
src/services/footprintService.ts:42:26
         const bucket = this.storage.bucket()
         const images: Express.Multer.File[] = files.image
         const audios: Express.Multer.File[] = files.audio
-        const allFiles = [ ...images, ...audios ]
+        const allFiles = []
         const promises: Promise<void>[] = []
 
killedBy: FootprintService uploads files to firebase storage and returns urls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/services/footprintService.ts:45:75
         const allFiles = [ ...images, ...audios ]
         const promises: Promise<void>[] = []
 
-        const downloadURLs = allFiles.map((value: Express.Multer.File) => {
-            const fileName = uuidv4()
-            const fullPath = this.fullPath(value, fileName, uid)
-            const bucketFile = bucket.file(fullPath)
-            const downloadToken = uuidv4()
-
-            promises.push(bucketFile.save(value.buffer, {
-                metadata: {
-                    contentType: value.mimetype,
-                    downloadTokens: downloadToken,
-                },
-                gzip: true,
-            }))
-
-            return this.createPersistentDownloadUrl(bucket.name, fullPath, downloadToken)
-        })
+        const downloadURLs = allFiles.map((value: Express.Multer.File) => {})
 
         await Promise.all(promises)
killedBy: FootprintService uploads files to firebase storage and returns urls
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] ObjectLiteral
src/services/footprintService.ts:52:27
             const downloadToken = uuidv4()
 
             promises.push(bucketFile.save(value.buffer, {
-                metadata: {
-                    contentType: value.mimetype,
-                    downloadTokens: downloadToken,
-                },
+                metadata: {},
                 gzip: true,
             }))

[Survived] BooleanLiteral
src/services/footprintService.ts:56:23
                     contentType: value.mimetype,
                     downloadTokens: downloadToken,
                 },
-                gzip: true,
+                gzip: false,
             }))
 

[Killed] BlockStatement
src/services/footprintService.ts:67:99
         return downloadURLs
     }
 
-    getTemperature = async (latitude: string, longitude: string): Promise<unknown | undefined> => {
-        // eslint-disable-next-line max-len
-        const response = await fetch(`https://api.openweathermap.org/data/2.5/weather?lat=${latitude}&lon=${longitude}&appid=${process.env.OPEN_WEATHER_API_KEY}&units=metric`)
-        if (!response.ok) {
-            return undefined
-        }
-        return await response.json() as unknown as Promise<unknown>
-    }
+    getTemperature = async (latitude: string, longitude: string): Promise<unknown | undefined> => {}
 
     uploadMiddleware = Multer({
killedBy: FootprintService getTemperature calls api with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://api.openweathermap.org/data/2.5/weather?lat=12.34&lon=23.234&appid=open_weather_api_key&units=metric"

Number of calls: 0

[Killed] ConditionalExpression
src/services/footprintService.ts:70:13
     getTemperature = async (latitude: string, longitude: string): Promise<unknown | undefined> => {
         // eslint-disable-next-line max-len
         const response = await fetch(`https://api.openweathermap.org/data/2.5/weather?lat=${latitude}&lon=${longitude}&appid=${process.env.OPEN_WEATHER_API_KEY}&units=metric`)
-        if (!response.ok) {
+        if (false) {
             return undefined
         }
killedBy: FootprintService getTemperature returns undefined if api call fails
statusReason: Error: expect(received).toBeUndefined()

Received: "temp"

[Killed] ConditionalExpression
src/services/footprintService.ts:70:13
     getTemperature = async (latitude: string, longitude: string): Promise<unknown | undefined> => {
         // eslint-disable-next-line max-len
         const response = await fetch(`https://api.openweathermap.org/data/2.5/weather?lat=${latitude}&lon=${longitude}&appid=${process.env.OPEN_WEATHER_API_KEY}&units=metric`)
-        if (!response.ok) {
+        if (true) {
             return undefined
         }
killedBy: FootprintService getTemperature returns temperature
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "temp"
Received: undefined

[Killed] BlockStatement
src/services/footprintService.ts:77:102
     }
 
     uploadMiddleware = Multer({
-        fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
-            if (file.mimetype === 'image/jpeg'
-                || file.mimetype === 'image/png'
-                || file.mimetype === 'image/jpg'
-                || file.mimetype === 'audio/aac'
-                || file.mimetype === 'audio/wav'
-                || file.mimetype === 'audio/mpeg'
-                || file.mimetype === 'audio/mp3'
-                || file.mimetype === 'video/mp4') {
-                // eslint-disable-next-line unicorn/no-null
-                callback(null, true)
-            } else {
-                callback(new Error('Type of file is not supported'))
-            }
-        },
+        fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {},
     })
 }
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true

Number of calls: 0

[Killed] EqualityOperator
src/services/footprintService.ts:78:17
 
     uploadMiddleware = Multer({
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
-            if (file.mimetype === 'image/jpeg'
+            if (file.mimetype !== 'image/jpeg'
                 || file.mimetype === 'image/png'
                 || file.mimetype === 'image/jpg'
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:78:17
 
     uploadMiddleware = Multer({
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
-            if (file.mimetype === 'image/jpeg'
-                || file.mimetype === 'image/png'
-                || file.mimetype === 'image/jpg'
-                || file.mimetype === 'audio/aac'
-                || file.mimetype === 'audio/wav'
-                || file.mimetype === 'audio/mpeg'
-                || file.mimetype === 'audio/mp3'
-                || file.mimetype === 'video/mp4') {
+            if (false) {
                 // eslint-disable-next-line unicorn/no-null
                 callback(null, true)
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:79:20
     uploadMiddleware = Multer({
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
             if (file.mimetype === 'image/jpeg'
-                || file.mimetype === 'image/png'
+                || file.mimetype !== 'image/png'
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
killedBy: FootprintService uploadMiddleware handles correct mimetype image/png
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:79:20
     uploadMiddleware = Multer({
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
             if (file.mimetype === 'image/jpeg'
-                || file.mimetype === 'image/png'
+                || false
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
killedBy: FootprintService uploadMiddleware handles correct mimetype image/png
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:80:20
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
             if (file.mimetype === 'image/jpeg'
                 || file.mimetype === 'image/png'
-                || file.mimetype === 'image/jpg'
+                || file.mimetype !== 'image/jpg'
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:80:20
         fileFilter(request: Request, file: Express.Multer.File, callback: Multer.FileFilterCallback) {
             if (file.mimetype === 'image/jpeg'
                 || file.mimetype === 'image/png'
-                || file.mimetype === 'image/jpg'
+                || false
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:81:20
             if (file.mimetype === 'image/jpeg'
                 || file.mimetype === 'image/png'
                 || file.mimetype === 'image/jpg'
-                || file.mimetype === 'audio/aac'
+                || file.mimetype !== 'audio/aac'
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
killedBy: FootprintService uploadMiddleware rejects invalid mimetype
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: Type of file is not supported]
Received: null, true

Number of calls: 1

[Survived] ConditionalExpression
src/services/footprintService.ts:81:20
             if (file.mimetype === 'image/jpeg'
                 || file.mimetype === 'image/png'
                 || file.mimetype === 'image/jpg'
-                || file.mimetype === 'audio/aac'
+                || false
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'

[Killed] EqualityOperator
src/services/footprintService.ts:82:20
                 || file.mimetype === 'image/png'
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
-                || file.mimetype === 'audio/wav'
+                || file.mimetype !== 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
                 || file.mimetype === 'audio/mp3'
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/wav
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:82:20
                 || file.mimetype === 'image/png'
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
-                || file.mimetype === 'audio/wav'
+                || false
                 || file.mimetype === 'audio/mpeg'
                 || file.mimetype === 'audio/mp3'
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/wav
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:83:20
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
-                || file.mimetype === 'audio/mpeg'
+                || file.mimetype !== 'audio/mpeg'
                 || file.mimetype === 'audio/mp3'
                 || file.mimetype === 'video/mp4') {
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/mpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:83:20
                 || file.mimetype === 'image/jpg'
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
-                || file.mimetype === 'audio/mpeg'
+                || false
                 || file.mimetype === 'audio/mp3'
                 || file.mimetype === 'video/mp4') {
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/mpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:84:20
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
-                || file.mimetype === 'audio/mp3'
+                || false
                 || file.mimetype === 'video/mp4') {
                 // eslint-disable-next-line unicorn/no-null
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/mp3
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:84:20
                 || file.mimetype === 'audio/aac'
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
-                || file.mimetype === 'audio/mp3'
+                || file.mimetype !== 'audio/mp3'
                 || file.mimetype === 'video/mp4') {
                 // eslint-disable-next-line unicorn/no-null
killedBy: FootprintService uploadMiddleware handles correct mimetype audio/mp3
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] ConditionalExpression
src/services/footprintService.ts:85:20
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
                 || file.mimetype === 'audio/mp3'
-                || file.mimetype === 'video/mp4') {
+                || false) {
                 // eslint-disable-next-line unicorn/no-null
                 callback(null, true)
killedBy: FootprintService uploadMiddleware handles correct mimetype video/mp4
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] EqualityOperator
src/services/footprintService.ts:85:20
                 || file.mimetype === 'audio/wav'
                 || file.mimetype === 'audio/mpeg'
                 || file.mimetype === 'audio/mp3'
-                || file.mimetype === 'video/mp4') {
+                || file.mimetype !== 'video/mp4') {
                 // eslint-disable-next-line unicorn/no-null
                 callback(null, true)
killedBy: FootprintService uploadMiddleware handles correct mimetype video/mp4
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: [Error: Type of file is not supported]

Number of calls: 1

[Killed] BooleanLiteral
src/services/footprintService.ts:87:32
                 || file.mimetype === 'audio/mp3'
                 || file.mimetype === 'video/mp4') {
                 // eslint-disable-next-line unicorn/no-null
-                callback(null, true)
+                callback(null, false)
             } else {
                 callback(new Error('Type of file is not supported'))
killedBy: FootprintService uploadMiddleware handles correct mimetype image/jpeg
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: null, true
Received: null, false

Number of calls: 1
