[Killed] BlockStatement
src/services/footprintService.ts:88:20
                 || file.mimetype === 'video/mp4') {
                 // eslint-disable-next-line unicorn/no-null
                 callback(null, true)
-            } else {
-                callback(new Error('Type of file is not supported'))
-            }
+            } else {}
         },
     })
killedBy: FootprintService uploadMiddleware rejects invalid mimetype
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: Type of file is not supported]

Number of calls: 0

[Killed] StringLiteral
src/services/footprintService.ts:89:36
                 // eslint-disable-next-line unicorn/no-null
                 callback(null, true)
             } else {
-                callback(new Error('Type of file is not supported'))
+                callback(new Error(""))
             }
         },
killedBy: FootprintService uploadMiddleware rejects invalid mimetype
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [Error: Type of file is not supported]
Received: [Error]

Number of calls: 1
